<template>
  <div>
    <div class="title_header">
      <div class="change_page" :class='{homeIn:$route.params.flight==0}'>
        <div :class='{active:pageShow==1}' @click="changepage(1)">
          <img v-if='pageShow==1' src="./../../../static/img/bus/busiconA@1.png" alt="">
          <img v-if='pageShow!==1' src="./../../../static/img/bus/busicon@1.png" alt="">
          机场巴士
        </div>
        <div :class='{active:pageShow==2}' @click="changepage(2)" v-if="$route.params.direction=='D'">
          <img v-if='pageShow==2' src="./../../../static/img/bus/busiconA@2.png" alt="">
          <img v-if='pageShow!==2' src="./../../../static/img/bus/busicon@2.png" alt="">
          自驾
        </div>
        <div :class='{active:pageShow==3}' @click="changepage(3)">
          <img v-if='pageShow==3' src="./../../../static/img/bus/busiconA@3.png" alt="">
          <img v-if='pageShow!==3' src="./../../../static/img/bus/busicon@3.png" alt="">
          公交
        </div>
        <div :class='{active:pageShow==4}' @click="changepage(4)" v-if="$route.params.direction=='A'">
          <img v-if='pageShow==4' src="./../../../static/img/bus/busiconA@3.png" alt="">
          <img v-if='pageShow!==4' src="./../../../static/img/bus/busicon@3.png" alt="">
          城际班车
        </div>
        <div id="switch_way" v-if="$route.params.flight=='0'" @click="homeChange">
          {{$route.params.direction=='A'?'离开机场':'去机场'}}
        </div>
      </div>
      <div class="search_page" v-show="pageShow!==4">
      <input type="text" placeholder="想去哪？" id="tipinput">
      </div>

    </div>
    <div id="wall">
      <div id="container" v-show="pageShow==1"></div>

      <div id="panel" v-show="pageShow==3">
        <p class="plh">请输入地址进行公交查询</p>
      </div>

      <div id="driver" v-show="pageShow==2">
        <div class="stopPage">
          <ul>
            <li :class='{stopA:stop==1}' @click=changeStop(1)>P1停车场</li>
            <li :class='{stopA:stop==2}' @click=changeStop(2)>P2停车场</li>
          </ul>
        </div>
        <div id="panel2">

        </div>
      </div>

      <div class="station_show" v-show=showStation>

        <div class="station_list">
          <ul>
            <li v-for="station in stationList">
              <span class="s_title">{{station.name}}</span><span class="s_price">¥20</span>
            </li>
          </ul>
        </div>
        <span class="showmap" @click="showStation=false">显示地图</span>
      </div>
    </div>
    <div class="info" id="cjbc" v-show="pageShow==4">
      <ul>
        <li>
          <span class="cjbc_title">扬州</span><span>全程约2小时</span><span class="cjbc_price">¥65</span>
          <div class="cjbc_info">
            <p>城市站点：扬州市扬子江北路108号扬鹏大酒店（沃尔玛西对面）</p>
            <p>咨询电话：0514-85160049 0514-87333398</p>
          </div>
          <div>
            <p>禄口机场发车时间：09:50 10:30 11:10 11:50 12:30 13:10 13:50 14:30 15:10 16:10 17:10 18:10 19:10 20:10 21:10 22:10 23:10</p>
            <p>城市候机楼发车时间：06:00 07:00 07:40 08:20 09:00 09:40 10:20 11:00 11:40 12:20 13:00 13:50 14:40 15:30 16:20 17:20 18:20</p>
          </div>
        </li>

        <li>
          <span class="cjbc_title">宜兴</span><span>全程约1.5小时</span><span class="cjbc_price">¥60</span>
          <div class="cjbc_info">
            <p>城市站点：宜兴市氿滨南路88号</p>
            <p>咨询电话：13376231891 0510-87332200</p>
          </div>
          <div>
            <p>禄口机场发车时间：10:30 12:00 13:30 15:00 16:00 17:00 18:30 20:30 22:30</p>
            <p>城市候机楼发车时间：05:10 06:20 07:50 09:20 10:50 12:50 14:20 15:50 17:50</p>
          </div>
        </li>

        <li>
          <span class="cjbc_title">无锡</span><span>全程约2小时</span><span class="cjbc_price">¥70</span>
          <div class="cjbc_info">
            <p>城市站点：无锡车站广场88号</p>
            <p>咨询电话：15365225600</p>
          </div>
          <div>
            <p>禄口机场发车时间：11:10 13:00 15:00 17:40 19:40 22:00</p>
            <p>城市候机楼发车时间：06:50 08:50 10:50 13:20 15:20 17:20</p>
          </div>
        </li>

        <li>
          <span class="cjbc_title">江阴</span><span>全程约2小时</span><span class="cjbc_price">¥70</span>
          <div class="cjbc_info">
            <p>城市站点：江阴市昊柏国际酒店大厅（绮山路189号）</p>
            <p>咨询电话：15365225600</p>
          </div>
          <div>
            <p>禄口机场发车时间：11:10 13:00 15:00 17:40 19:40 22:00</p>
            <p>城市候机楼发车时间：06:50 08:50 10:50 13:20 15:20 17:20</p>
          </div>
        </li>

        <li>
          <span class="cjbc_title">丹阳</span><span>全程约2小时</span><span class="cjbc_price">¥55</span>
          <div class="cjbc_info">
            <p>城市站点：丹阳汽车客运站（华阳路72号）</p>
            <p>咨询电话：0511-86522181 13852925670</p>
          </div>
          <div>
            <p>禄口机场发车时间：10:30 12:00 13:30 15:00 16:30 18:00 20:30</p>
            <p>城市候机楼发车时间：07:00 08:40 10:20 12:50 14:20 15:50 17:40</p>
          </div>
        </li>

        <li>
          <span class="cjbc_title">常州</span><span>全程约2小时</span><span class="cjbc_price">¥70</span>
          <div class="cjbc_info">
            <p>城市站点：常州汽车客运总站（北广场）</p>
            <p>咨询电话：0519-88880012</p>
          </div>
          <div>
            <p>禄口机场发车时间：10:00 11:30 12:30 13:30 14:30 15:30 17:00 18:30 20:00 22:00</p>
            <p>城市候机楼发车时间：04:45 06:45 08:35 10:10 11:10 13:10 14:10 15:10 16:40 18:10</p>
          </div>
        </li>

        <li>
          <span class="cjbc_title">扬中</span><span>全程约2小时</span><span class="cjbc_price">¥60</span>
          <div class="cjbc_info">
            <p>城市站点：扬中客运汽车中心站（环城南路999号）</p>
            <p>咨询电话：0511-88324858 0511-85154858</p>
          </div>
          <div>
            <p>禄口机场发车时间：11:05 13:35 16:30 19:30</p>
            <p>城市候机楼发车时间：06:30 08:10 13:40 15:50</p>
          </div>
        </li>

        <li>
          <span class="cjbc_title">溧阳</span><span>全程约1.2小时</span><span class="cjbc_price">¥45</span>
          <div class="cjbc_info">
            <p>城市站点：溧阳市燕山中路9号（皇廷大酒店南侧）</p>
            <p>咨询电话：0519-87678111</p>
          </div>
          <div>
            <p>禄口机场发车时间：10:30 12:00 13:30 15:00 16:30 18:00 19:30 22:00</p>
            <p>城市候机楼发车时间：05:50 07:10 08:30 10:30 12:30 14:00 16:00 18:00</p>
          </div>
        </li>

        <li>
          <span class="cjbc_title">镇江句容</span><span>全程约1.5小时</span><span class="cjbc_price">¥60</span>
          <div class="cjbc_info">
            <p>城市站点：镇江城市候机楼（新火车站南广场）</p>
            <p>咨询电话：0511-85233898</p>
          </div>
          <div>
            <p>禄口机场发车时间：10:00 11:00 12:00 13:00 14:00 15:00 16:00 17:10 18:00 19:30 21:00 22:30</p>
            <p>城市候机楼发车时间：05:30 07:00 08:00 09:00 10:00 11:00 12:30 14:00 15:00 16:00 17:00 18:30</p>
          </div>
        </li>

        <li>
          <span class="cjbc_title">泰州</span><span>全程约2.5小时</span><span class="cjbc_price">¥80</span>
          <div class="cjbc_info">
            <p>城市站点：泰州汽车南站</p>
            <p>咨询电话：0523-86050011</p>
          </div>
          <div>
            <p>禄口机场发车时间：10:30 12:30 14:30 16:30 19:00 21:30</p>
            <p>城市候机楼发车时间：05:50 08:20 10:20 13:20 15:20 17:30</p>
          </div>
        </li>

        <li>
          <span class="cjbc_title">金坛</span><span>全程约1.2小时</span><span class="cjbc_price">¥50</span>
          <div class="cjbc_info">
            <p>城市站点：金坛区东环2路39号</p>
            <p>咨询电话：0519-82395566</p>
          </div>
          <div>
            <p>禄口机场发车时间：10:30 12:00 13:30 15:00 16:00 17:30 19:00 21:00</p>
            <p>城市候机楼发车时间：05:10 07:10 08:20 10:20 12:20 13:50 15:50 17:50</p>
          </div>
        </li>

        <li>
          <span class="cjbc_title">宝应</span><span>全程约3.5小时</span><span class="cjbc_price">¥90</span>
          <div class="cjbc_info">
            <p>城市站点：宝应大道66号</p>
            <p>咨询电话：0514-80905283</p>
          </div>
          <div>
            <p>禄口机场发车时间：10:30 12:30 14:30 16:30 18:30 20:30</p>
            <p>城市候机楼发车时间：05:00 07:00 09:00 11:00 13:00 15:00</p>
          </div>
        </li>

        <li>
          <span class="cjbc_title">高邮</span><span>全程约2.5小时</span><span class="cjbc_price">¥80</span>
          <div class="cjbc_info">
            <p>城市站点：高邮市秦邮路148号</p>
            <p>咨询电话：0514-84580898</p>
          </div>
          <div>
            <p>禄口机场发车时间：10:30 12:30 14:30 16:30 18:30 20:30</p>
            <p>城市候机楼发车时间：05:50 07:50 09:50 11:50 13:50 15:50</p>
          </div>
        </li>

        <li>
          <span class="cjbc_title">靖江</span><span>全程约2小时</span><span class="cjbc_price">¥158</span>
          <div class="cjbc_info">
            <p>城市站点：靖江市兴业路2号（汽车客运站内）</p>
            <p>咨询电话：0523-82618818</p>
          </div>
          <div>
            <p>禄口机场发车时间：10：00 12：00 14：00 16：20 18：40 21：00</p>
            <p>城市候机楼发车时间：05：55 07：30 09：40 12：50 14：50 16：50</p>
          </div>
        </li>

        <li>
          <span class="cjbc_title">淮安</span><span>全程约3.5小时</span><span class="cjbc_price">¥90</span>
          <div class="cjbc_info">
            <p>城市站点：淮安市健康东路55号（淮州宾馆院内）</p>
            <p>咨询电话：0517-83945111 0517-83933123</p>
          </div>
          <div>
            <p>禄口机场发车时间：10:00 11:00 12:00 13:00 14:30 16:00 17:30 19:00 20:30 22:30</p>
            <p>城市候机楼发车时间：06:40 07:10 08:00 09:30 11:00 12:00 13:00 14:30 15:30 16:30</p>
          </div>
        </li>

        <li>
          <span class="cjbc_title">沭阳</span><span>全程约5小时</span><span class="cjbc_price">¥108</span>
          <div class="cjbc_info">
            <p>城市站点：沭阳深圳西路紫馨花园</p>
            <p>咨询电话：0527-83992111</p>
          </div>
          <div>
            <p>禄口机场发车时间：10:00 12:30 14:35 16:00 18:10 20:30</p>
            <p>城市候机楼发车时间：06:50 08:00 09:20 10:20 13:30 15:30</p>
          </div>
        </li>

        <li>
          <span class="cjbc_title">宿迁</span><span>全程约4小时</span><span class="cjbc_price">¥95</span>
          <div class="cjbc_info">
            <p>城市站点：宿迁市西湖路86号 城宇大厦113-115</p>
            <p>咨询电话：0527-82990028</p>
          </div>
          <div>
            <p>禄口机场发车时间：12:30 14:35 16:00 18:10 20:30</p>
            <p>城市候机楼发车时间：07:20（节点：曹集入口）11:40 14:50</p>
          </div>
        </li>

        <li>
          <span class="cjbc_title">马鞍山</span><span>全程约1小时</span><span class="cjbc_price">¥40</span>
          <div class="cjbc_info">
            <p>城市站点：马鞍山江东大道（东方明珠1956商业街2号楼）</p>
            <p>咨询电话：0555-2473333</p>
          </div>
          <div>
            <p>禄口机场发车时间：10:00 11:00 12:00 13:00 14:00 15:00 16:00 17:00 18:00 19:00 20:00 21:30</p>
            <p>城市候机楼发车时间：06:00 08:00 09:00 10:30 12:00 13:00 14:00 15:00 16:00 17:00 18:00 19:00</p>
          </div>
        </li>

        <li>
          <span class="cjbc_title">滁州</span><span>全程约1.5小时</span><span class="cjbc_price">¥60</span>
          <div class="cjbc_info">
            <p>城市站点：滁州市环城路1号（南湖公园）</p>
            <p>咨询电话：0550-3038655 15905500606</p>
          </div>
          <div>
            <p>禄口机场发车时间：10:30 12:00 13:30 15:00 16:30 18:00 20:00 22:00</p>
            <p>城市候机楼发车时间：07:00 08:30 10:00 11:30 13:00 14:30 16:00 18:00</p>
          </div>
        </li>

        <li>
          <span class="cjbc_title">盐城</span><span>全程约4小时</span><span class="cjbc_price">¥120</span>
          <div class="cjbc_info">
            <p>城市站点：盐城汽车客运站</p>
            <p>咨询电话：0515-8822666</p>
          </div>
          <div>
            <p>禄口机场发车时间：14:00 16:00 18:30</p>
            <p>城市候机楼发车时间：07:20 10:20 13:00</p>
          </div>
        </li>

        <li>
          <span class="cjbc_title">芜湖</span><span>全程约2小时</span><span class="cjbc_price">¥60</span>
          <div class="cjbc_info">
            <p>城市站点：芜湖两站广场</p>
            <p>咨询电话：0553-3116888</p>
          </div>
          <div>
            <p>禄口机场发车时间：10:00 11:00 12:00 13:00 14:00 15:00 16:00 17:00 18:00 19:00 20:30 22:00</p>
            <p>城市候机楼发车时间：05:20 07:00 08:00 09:00 10:00 11:00 12:30 13:30 14:30 15:30 16:30 18:00</p>
          </div>
        </li>

        <li>
          <span class="cjbc_title">泰兴</span><span>全程约2.5小时</span><span class="cjbc_price">¥120</span>
          <div class="cjbc_info">
            <p>城市站点：泰兴汽车站</p>
            <p>咨询电话：0523-87756290</p>
          </div>
          <div>
            <p>禄口机场发车时间：10:00 12:00 14:00 16:30 19:00</p>
            <p>城市候机楼发车时间：06:40 08:30 10:30 13:30 15:50</p>
          </div>
        </li>

        <li>
          <span class="cjbc_title">宣城</span><span>全程约2小时</span><span class="cjbc_price">¥65</span>
          <div class="cjbc_info">
            <p>城市站点：宣城梅溪路金领公馆</p>
            <p>咨询电话：0563-3021111</p>
          </div>
          <div>
            <p>禄口机场发车时间：11:30 13:35 15:30 17:30 19:30 21:00</p>
            <p>城市候机楼发车时间：07:00 10:00 12:00 14:00 16:00 18:00</p>
          </div>
        </li>

        <li>
          <span class="cjbc_title">天长</span><span>全程约2小时</span><span class="cjbc_price">¥70</span>
          <div class="cjbc_info">
            <p>城市站点：天长城市候机楼</p>
            <p>咨询电话：0550-7788288</p>
          </div>
          <div>
            <p>禄口机场发车时间：09:30 10:30 11:30 12:30 13:30 14:30 15:30 16:30 17:30 19:00 21:00 23:00</p>
            <p>城市候机楼发车时间：05:10 06:30 07:30 08:30 09:30 10:30 12:00 13:00 14:00 15:00 16:00 17:30</p>
          </div>
        </li>

        <li>
          <span class="cjbc_title">宁国</span><span>全程约2.5小时</span><span class="cjbc_price">¥100</span>
          <div class="cjbc_info">
            <p>城市站点：宁国大道体育场正门</p>
            <p>咨询电话：400-1618128</p>
          </div>
          <div>
            <p>禄口机场发车时间：11:00 13:30 15:30 17:30 21:00</p>
            <p>城市候机楼发车时间：06:30 09:30 11:00 13:30 16:00</p>
          </div>
        </li>

        <li>
          <span class="cjbc_title">蚌埠明光</span><span>全程约3.5小时</span><span class="cjbc_price">¥100 / ¥80</span>
          <div class="cjbc_info">
            <p>城市站点：蚌埠市升平街190号</p>
            <p>咨询电话：0552一7125999</p>
          </div>
          <div>
            <p>禄口机场发车时间：10:30 13:00 17:00 20:00</p>
            <p>城市候机楼发车时间：05:00 06:30 09:30 12:30 14:30</p>
          </div>
        </li>
      </ul>
    </div>
    <div class="info" id="panel3" v-show="pageShow==1">
      <div class="swiper-container">
        <div class="swiper-wrapper">
          <div class="swiper-slide">
            <div class="line_page">
              <div class="line_title">
                <span><img src="./../../../static/img/bus/busiconA@1.png" alt="">到达站点</span><span class="bline">机场巴士1号线</span>
              </div>
              <div class="line_body">
                <span class="lb1">
                  <p>20元</p>
                  <p>票价</p>
                </span>
                <span class="vline"></span>
                <span  class="lb2">
                  <p class="pointName">{{point}}</p>
                  <p class="pointDetail" v-if='$route.params.direction=="D"'>火车站发车时间为4:30 -- 21:00，每30分钟一班，龙蟠中路451号南京机场宾馆经停站每班车约晚10至15分钟。由南京南站至机场约需1小时。</p>
                  <p class="pointDetail" v-if='$route.params.direction=="A"'>从早上第一个航班落地至当天最后一个航班结束，下客站为翠屏山宾馆、雨花广场、秦虹桥、七里街（机场宾馆）、西华门、南京火车站。</p>
                </span>
              </div>
              <div class="checkAll" @click="showAllStation(1)">
                查看所有站点
              </div>
            </div>
          </div>
          <div class="swiper-slide">
            <div class="line_page">
              <div class="line_title">
                <span><img src="./../../../static/img/bus/busiconA@1.png" alt="">到达站点</span><span class="bline">机场巴士2号线</span>
              </div>
              <div class="line_body">
                <span class="lb1">
                  <p>20元</p>
                  <p>票价</p>
                </span>
                <span class="vline"></span>
                <span  class="lb2">
                  <p class="pointName">{{point}}</p>
                  <p class="pointDetail" v-if='$route.params.direction=="D"'>发车时间为4:30 -- 21:00，每30分钟发一班。途径南京南站，车时间为每天5:40至21:00，每30分钟一班。班车点设在南京南站的汽车客运站内，由南京南站至机场约需35分钟。</p>
                  <p class="pointDetail" v-if='$route.params.direction=="A"'>从早上第一个航班落地至23：30。下客站为南京南站、中华门、水西门、汉中门、万达广场 。</p>
                </span>
              </div>
              <div class="checkAll" @click="showAllStation(2)">
                查看所有站点
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <a :href="'http://222.190.243.8:8080/H5/StopDetail.html'" id="stopDetail" @click="toStopDetail" v-show="pageShow==2">
      查看停车场详情
    </a>
  </div>
</template>

<script>
  import { Toast } from 'mint-ui';
  import AMap from 'AMap'
  import axios from "axios"
  import swiper from "swiper"
  import './../../../node_modules/swiper/dist/css/swiper.css'
  export default {
    name: "busLineA",
    data(){
      return{
        stationList:[],
        //1号线 2号线
        allStation:[
          [{"status":"1","trans_flag":"","code":"320115","name":"南京禄口机场","station_num":"1","poiid1":"BS11438559","start_time":"","spell":"nan jing lu kou ji chang","station_id":"320100072314002","end_time":"","xy_coords":"118.876617;31.731215","poiid2_xy":"118.876839;31.731363","poiid2":"BV10560267"},{"status":"1","trans_flag":"","code":"320115","name":"翠屏山宾馆","station_num":"2","poiid1":"BS11299049","start_time":"","spell":"cui ping shan bin guan","station_id":"320100072314008","end_time":"","xy_coords":"118.795319;31.92849","poiid2_xy":"118.795319;31.928490","poiid2":"BV10560365"},{"status":"1","trans_flag":"","code":"320114","name":"雨花广场","station_num":"3","poiid1":"BS10847759","start_time":"","spell":"yu hua guang chang","station_id":"320100072314004","end_time":"","xy_coords":"118.784599;31.992401","poiid2_xy":"118.784599;31.992401","poiid2":"BV10416134"},{"status":"1","trans_flag":"","code":"320104","name":"秦虹桥","station_num":"4","poiid1":"BS10643923","start_time":"","spell":"qin hong qiao","station_id":"320100072314009","end_time":"","xy_coords":"118.79673;32.009586","poiid2_xy":"118.796768;32.009716","poiid2":"BV10054612"},{"status":"1","trans_flag":"","code":"320104","name":"七里街","station_num":"5","poiid1":"BS11362739","start_time":"","spell":"qi li jie","station_id":"320100072314011","end_time":"","xy_coords":"118.80014;32.019787","poiid2_xy":"118.799774;32.019814","poiid2":"BV10054526"},{"status":"1","trans_flag":"","code":"320104","name":"西华门","station_num":"6","poiid1":"BS11299050","start_time":"","spell":"xi hua men","station_id":"320100072314010","end_time":"","xy_coords":"118.803505;32.036488","poiid2_xy":"118.803505;32.036488","poiid2":"BV10560366"},{"status":"1","trans_flag":"","code":"320102","name":"南京火车站","station_num":"7","poiid1":"BS10847761","start_time":"","spell":"nan jing huo che zhan","station_id":"320100072314007","end_time":"","xy_coords":"118.79882;32.084076","poiid2_xy":"118.798820;32.084076","poiid2":"BV10416135"}],
          [{"status":"1","trans_flag":"","code":"320102","name":"南京火车站","station_num":"1","poiid1":"BS12193765","start_time":"","spell":"nan jing huo che zhan","station_id":"320100072083005","end_time":"","xy_coords":"118.798576;32.084152","poiid2_xy":"118.798820;32.084076","poiid2":"BV10416135"},{"status":"1","trans_flag":"","code":"320104","name":"七里街","station_num":"2","poiid1":"BS11362739","start_time":"","spell":"qi li jie","station_id":"320100072083006","end_time":"","xy_coords":"118.80014;32.019772","poiid2_xy":"118.799774;32.019814","poiid2":"BV10054526"},{"status":"1","trans_flag":"","code":"320115","name":"南京禄口机场","station_num":"3","poiid1":"BS11438559","start_time":"","spell":"nan jing lu kou ji chang","station_id":"320100072083004","end_time":"","xy_coords":"118.876633;31.731224","poiid2_xy":"118.876839;31.731363","poiid2":"BV10560267"}],

          [{"status":"1","trans_flag":"","code":"320115","name":"南京禄口机场","station_num":"1","poiid1":"BS11438559","start_time":"","spell":"nan jing lu kou ji chang","station_id":"320100073960002","end_time":"","xy_coords":"118.876839;31.731363","poiid2_xy":"118.876839;31.731363","poiid2":"BV10560267"},{"status":"1","trans_flag":"","code":"320114","name":"南京南站","station_num":"2","poiid1":"BS11957472","start_time":"","spell":"nan jing nan zhan","station_id":"320100073960013","end_time":"","xy_coords":"118.796822;31.970547","poiid2_xy":"118.796306;31.968737","poiid2":"BV10053670"},{"status":"1","trans_flag":"","code":"320104","name":"中华门","station_num":"3","poiid1":"BS11146400","start_time":"","spell":"zhong hua men","station_id":"320100073960009","end_time":"","xy_coords":"118.776688;32.007401","poiid2_xy":"118.776688;32.007401","poiid2":"BV10518466"},{"status":"1","trans_flag":"","code":"320104","name":"水西门","station_num":"4","poiid1":"BS12157194","start_time":"","spell":"shui xi men","station_id":"320100073960010","end_time":"","xy_coords":"118.769814;32.031612","poiid2_xy":"118.772987;32.028103","poiid2":"BV10055310"},{"status":"1","trans_flag":"","code":"320104","name":"汉中门","station_num":"5","poiid1":"BS10803261","start_time":"","spell":"han zhong men","station_id":"320100073960011","end_time":"","xy_coords":"118.767357;32.042896","poiid2_xy":"118.767357;32.042896","poiid2":"BV10055009"},{"status":"1","trans_flag":"","code":"320105","name":"河西万达广场","station_num":"6","poiid1":"BS11282813","start_time":"","spell":"he xi wan da guang chang","station_id":"320100073960012","end_time":"","xy_coords":"118.738632;32.031868","poiid2_xy":"118.738032;32.031667","poiid2":"BV10518468"}],
          [{"status":"1","trans_flag":"","code":"320105","name":"河西万达广场","station_num":"1","poiid1":"BS11146404","start_time":"","spell":"he xi wan da guang chang","station_id":"320100072316007","end_time":"","xy_coords":"118.738032;32.031667","poiid2_xy":"118.738032;32.031667","poiid2":"BV10518468"},{"status":"1","trans_flag":"","code":"320115","name":"南京南站","station_num":"2","poiid1":"BS11978062","start_time":"","spell":"nan jing nan zhan","station_id":"320100072316006","end_time":"","xy_coords":"118.795357;31.968185","poiid2_xy":"118.796306;31.968737","poiid2":"BV10053670"},{"status":"1","trans_flag":"","code":"320115","name":"南京禄口机场","station_num":"3","poiid1":"BS11438559","start_time":"","spell":"nan jing lu kou ji chang","station_id":"320100072316003","end_time":"","xy_coords":"118.876839;31.731358","poiid2_xy":"118.876839;31.731363","poiid2":"BV10560267"}]
        ],
        list:{},
        pageShow:1,
        swiper:{},
        ss:{poi:{
          name:""
          }
        },
        point:"南京火车站",
        stop:1,
        showStation:false,
        markers:[
          [
            {
              icon: './../../static/img/point.png',
              xy_coords: "118.876617;31.731215",
              name:"南京禄口机场"
            },
            {
              icon: './../../static/img/point.png',
              xy_coords: "118.795319;31.92849",
              name:"翠屏山宾馆"
            },
            {
              icon: './../../static/img/point.png',
              xy_coords: "118.795319;31.92849",
              name:"翠屏山宾馆"
            },
            {
              icon: './../../static/img/point.png',
              xy_coords: "118.784599;31.992401",
              name:"雨花广场"
            },
            {
              icon: './../../static/img/point.png',
              xy_coords: "118.79673;32.009586",
              name:"秦虹桥"
            },
            {
              icon: './../../static/img/point.png',
              xy_coords: "118.80014;32.019787",
              name:"七里街"
            },
            {
              icon: './../../static/img/point.png',
              xy_coords: "118.803505;32.036488",
              name:"西华门"
            },
            {
              icon: './../../static/img/point.png',
              xy_coords: "118.79882;32.084076",
              name:"南京火车站"
            }
        ],[
          {
            icon: './../../static/img/point.png',
            "name": "南京火车站",
            "xy_coords": "118.798576;32.084152",
          }, {
            icon: './../../static/img/point.png',
            "name": "七里街",
            "xy_coords": "118.80014;32.019772",
          }, {
            icon: './../../static/img/point.png',
            "name": "南京禄口机场",
            "xy_coords": "118.876633;31.731224",
          }
          ],
          [{
            icon: './../../static/img/point.png',
            "status": "1",
            "trans_flag": "",
            "code": "320115",
            "name": "南京禄口机场",
            "station_num": "1",
            "poiid1": "BS11438559",
            "start_time": "",
            "spell": "nan jing lu kou ji chang",
            "station_id": "320100073960002",
            "end_time": "",
            "xy_coords": "118.876839;31.731363",
            "poiid2_xy": "118.876839;31.731363",
            "poiid2": "BV10560267"

          }, {
            icon: './../../static/img/point.png',
            "status": "1",
            "trans_flag": "",
            "code": "320114",
            "name": "南京南站",
            "station_num": "2",
            "poiid1": "BS11957472",
            "start_time": "",
            "spell": "nan jing nan zhan",
            "station_id": "320100073960013",
            "end_time": "",
            "xy_coords": "118.796822;31.970547",
            "poiid2_xy": "118.796306;31.968737",
            "poiid2": "BV10053670"
          }, {
            icon: './../../static/img/point.png',
            "status": "1",
            "trans_flag": "",
            "code": "320104",
            "name": "中华门",
            "station_num": "3",
            "poiid1": "BS11146400",
            "start_time": "",
            "spell": "zhong hua men",
            "station_id": "320100073960009",
            "end_time": "",
            "xy_coords": "118.776688;32.007401",
            "poiid2_xy": "118.776688;32.007401",
            "poiid2": "BV10518466"
          }, {
            icon: './../../static/img/point.png',
            "status": "1",
            "trans_flag": "",
            "code": "320104",
            "name": "水西门",
            "station_num": "4",
            "poiid1": "BS12157194",
            "start_time": "",
            "spell": "shui xi men",
            "station_id": "320100073960010",
            "end_time": "",
            "xy_coords": "118.769814;32.031612",
            "poiid2_xy": "118.772987;32.028103",
            "poiid2": "BV10055310"
          }, {
            icon: './../../static/img/point.png',
            "status": "1",
            "trans_flag": "",
            "code": "320104",
            "name": "汉中门",
            "station_num": "5",
            "poiid1": "BS10803261",
            "start_time": "",
            "spell": "han zhong men",
            "station_id": "320100073960011",
            "end_time": "",
            "xy_coords": "118.767357;32.042896",
            "poiid2_xy": "118.767357;32.042896",
            "poiid2": "BV10055009"
          }, {
            icon: './../../static/img/point.png',
            "status": "1",
            "trans_flag": "",
            "code": "320105",
            "name": "河西万达广场",
            "station_num": "6",
            "poiid1": "BS11282813",
            "start_time": "",
            "spell": "he xi wan da guang chang",
            "station_id": "320100073960012",
            "end_time": "",
            "xy_coords": "118.738632;32.031868",
            "poiid2_xy": "118.738032;32.031667",
            "poiid2": "BV10518468"
          }],
          [{
            icon: './../../static/img/point.png',
            "status": "1",
            "trans_flag": "",
            "code": "320105",
            "name": "河西万达广场",
            "station_num": "1",
            "poiid1": "BS11146404",
            "start_time": "",
            "spell": "he xi wan da guang chang",
            "station_id": "320100072316007",
            "end_time": "",
            "xy_coords": "118.738032;32.031667",
            "poiid2_xy": "118.738032;32.031667",
            "poiid2": "BV10518468"
          }, {
            icon: './../../static/img/point.png',
            "status": "1",
            "trans_flag": "",
            "code": "320115",
            "name": "南京南站",
            "station_num": "2",
            "poiid1": "BS11978062",
            "start_time": "",
            "spell": "nan jing nan zhan",
            "station_id": "320100072316006",
            "end_time": "",
            "xy_coords": "118.795357;31.968185",
            "poiid2_xy": "118.796306;31.968737",
            "poiid2": "BV10053670"
          }, {
            icon: './../../static/img/point.png',
            "status": "1",
            "trans_flag": "",
            "code": "320115",
            "name": "南京禄口机场",
            "station_num": "3",
            "poiid1": "BS11438559",
            "start_time": "",
            "spell": "nan jing lu kou ji chang",
            "station_id": "320100072316003",
            "end_time": "",
            "xy_coords": "118.876839;31.731358",
            "poiid2_xy": "118.876839;31.731363",
            "poiid2": "BV10560267"
          }]

        ],
        driverDestination:{},
        //0、 1号线 机场-南京南站 1、 1号线 南京南站-机场 2、 2号线 机场-河西万达广场 3、 2号线 河西万达广场-机场
        xs:[
          "118.876617,118.876823,118.877029,118.877167,118.877304,118.877419,118.877563,118.877937,118.878128,118.878296,118.878403,118.878456,118.878464,118.878456,118.878418,118.878319,118.878281,118.87825,118.87822,118.878227,118.878265,118.878319,118.878387,118.878464,118.878517,118.878555,118.878647,118.878693,118.878754,118.878822,118.879005,118.879662,118.87986,118.880005,118.882896,118.884491,118.885468,118.886719,118.890747,118.892776,118.893311,118.893646,118.89415,118.894714,118.895088,118.895432,118.895775,118.895813,118.895958,118.896111,118.896301,118.896492,118.896561,118.896591,118.896591,118.896545,118.8965,118.896461,118.896408,118.896309,118.896194,118.895943,118.895714,118.895294,118.8946,118.894081,118.893417,118.892746,118.891708,118.891701,118.89016,118.889931,118.889618,118.888664,118.887016,118.885574,118.884758,118.88401,118.883354,118.882362,118.880997,118.88002,118.879173,118.878052,118.877327,118.876587,118.870262,118.865593,118.862312,118.861031,118.860504,118.8591,118.858734,118.857971,118.857246,118.856598,118.855888,118.855331,118.849358,118.848038,118.840385,118.837265,118.836983,118.83625,118.835205,118.834587,118.833878,118.833076,118.832642,118.831627,118.830536,118.830261,118.829659,118.828873,118.828438,118.827934,118.827393,118.826927,118.825905,118.825439,118.825058,118.82473,118.824341,118.823822,118.823074,118.82267,118.822205,118.821861,118.821663,118.821152,118.821129,118.821007,118.820763,118.820419,118.820038,118.819862,118.819672,118.819534,118.819344,118.819237,118.819191,118.819046,118.818878,118.818871,118.818817,118.81881,118.818802,118.818764,118.818733,118.818718,118.818718,118.81871,118.81868,118.818665,118.818665,118.818626,118.818619,118.818596,118.818542,118.818489,118.818375,118.818314,118.818176,118.818024,118.817856,118.817642,118.817398,118.817116,118.816788,118.816597,118.816475,118.816109,118.816032,118.815437,118.81517,118.814713,118.814354,118.814301,118.81385,118.813515,118.813232,118.812889,118.812508,118.812363,118.811913,118.811096,118.810432,118.809738,118.809723,118.809517,118.808983,118.807381,118.806473,118.805817,118.80526,118.804962,118.804184,118.80397,118.803749,118.803299,118.802536,118.801979,118.801079,118.800552,118.800209,118.799904,118.799782,118.799683,118.799355,118.799278,118.798729,118.798508,118.798325,118.798058,118.797867,118.797653,118.797592,118.797447,118.797363,118.797203,118.797173,118.796928,118.796875,118.796776,118.796753,118.796638,118.7966,118.796562,118.796494,118.796303,118.796272,118.796257,118.796181,118.796181,118.796112,118.796097,118.796059,118.796043,118.796005,118.795975,118.795685,118.795555,118.795494,118.795403,118.795319,118.795311,118.795135,118.795036,118.794792,118.794685,118.794189,118.793915,118.793716,118.793297,118.793198,118.792831,118.792274,118.792015,118.790993,118.790649,118.790176,118.788879,118.788544,118.787949,118.787567,118.787323,118.787148,118.786926,118.786812,118.786377,118.785805,118.785286,118.784882,118.784592,118.784172,118.784027,118.783806,118.783646,118.783203,118.783005,118.78289,118.782799,118.782722,118.782654,118.782585,118.782578,118.782578,118.7826,118.782692,118.782761,118.782913,118.78299,118.78302,118.783035,118.783028,118.783005,118.782951,118.782936,118.782852,118.782799,118.782677,118.782387,118.782341,118.782089,118.781906,118.781929,118.781929,118.781929,118.781631,118.781631,118.781631,118.781631,118.781441,118.781326,118.781288,118.781265,118.781212,118.781212,118.781212,118.781288,118.781311,118.781387,118.781433,118.781464,118.781509,118.784599,118.784599,118.785103,118.786285,118.786415,118.786736,118.78714,118.787575,118.787811,118.788376,118.789513,118.789597,118.790298,118.790558,118.790619,118.791466,118.792786,118.793396,118.793823,118.794159,118.794434,118.794792,118.794998,118.795349,118.795486,118.795624,118.795776,118.795921,118.79599,118.796089,118.796249,118.796242,118.796303,118.796341,118.796364,118.796364,118.796364,118.796303,118.796242,118.796242,118.796219,118.796165,118.796158,118.79615,118.796234,118.796188,118.796165,118.796211,118.796219,118.796257,118.796272,118.796356,118.796417,118.796486,118.79673,118.79673,118.797211,118.797234,118.797577,118.798149,118.798363,118.798462,118.7985,118.798668,118.799011,118.799309,118.799469,118.799515,118.799606,118.79985,118.800064,118.800125,118.80014,118.80014,118.80014,118.800316,118.800339,118.800446,118.800537,118.800468,118.800636,118.800682,118.800888,118.801086,118.801201,118.801559,118.801689,118.80172,118.801804,118.801842,118.801872,118.801903,118.801956,118.801979,118.802017,118.802116,118.802284,118.80233,118.802376,118.802528,118.802605,118.802742,118.802757,118.802887,118.803001,118.80307,118.803154,118.803177,118.803291,118.803261,118.803345,118.803383,118.803505,118.803505,118.803642,118.804283,118.804535,118.804634,118.804665,118.804726,118.804932,118.805,118.805069,118.805183,118.805229,118.805313,118.805832,118.806305,118.806572,118.80674,118.806946,118.80703,118.807343,118.807564,118.807625,118.807831,118.807945,118.808067,118.808289,118.808467,118.808818,118.808962,118.809011,118.809027,118.808989,118.808877,118.808823,118.808726,118.808533,118.808405,118.808195,118.80768,118.806447,118.805529,118.805325,118.805181,118.805079,118.804891,118.804837,118.80481,118.804789,118.804821,118.804791,118.804796,118.804802,118.80485,118.804968,118.80507,118.805177,118.805467,118.805638,118.805767,118.806271,118.807039,118.807623,118.807788,118.807847,118.807884,118.808008,118.80811,118.808474,118.808592,118.808737,118.808877,118.808957,118.809086,118.8092,118.809329,118.809506,118.809635,118.809812,118.809919,118.809908,118.809882,118.809844,118.80979,118.809731,118.809635,118.809442,118.809184,118.809039,118.808905,118.808798,118.807076,118.805588,118.804146,118.804031,118.802979,118.802658,118.80262,118.80175,118.800758,118.800568,118.800079,118.799759,118.79969,118.799637,118.799149,118.798996,118.798851,118.79882",
          "118.798576,118.797302,118.797081,118.797012,118.796989,118.796997,118.796997,118.796997,118.797028,118.797058,118.797089,118.797165,118.797249,118.797356,118.797485,118.797737,118.798035,118.798615,118.799141,118.799339,118.799461,118.799576,118.799812,118.800415,118.800591,118.801559,118.802444,118.802551,118.802711,118.80394,118.803978,118.807205,118.807259,118.807297,118.807381,118.807564,118.807915,118.807991,118.808067,118.808105,118.808151,118.808205,118.808212,118.808228,118.808159,118.807693,118.807411,118.807205,118.80706,118.806931,118.806793,118.806557,118.806366,118.806145,118.806038,118.805939,118.805817,118.805695,118.805588,118.805382,118.805298,118.805138,118.805069,118.805038,118.804993,118.804924,118.804703,118.804649,118.804604,118.804581,118.804581,118.804611,118.804672,118.804726,118.804756,118.80481,118.804947,118.805191,118.805275,118.805779,118.806641,118.80751,118.808083,118.808296,118.808517,118.808571,118.80864,118.808746,118.80883,118.808853,118.808868,118.808868,118.80883,118.808693,118.808243,118.808128,118.808052,118.807915,118.807823,118.807724,118.807655,118.807518,118.807457,118.807358,118.807274,118.80703,118.806892,118.805672,118.805191,118.805084,118.804932,118.804649,118.804497,118.804474,118.804131,118.803505,118.803246,118.803215,118.803139,118.803001,118.80291,118.802849,118.80265,118.802467,118.802383,118.802238,118.801788,118.801689,118.801659,118.80159,118.801559,118.801491,118.801468,118.801437,118.801392,118.801285,118.800728,118.800522,118.800491,118.800331,118.800148,118.800064,118.799835,118.799721,118.800064,118.800125,118.80014,118.800224,118.80027,118.800339,118.800468,118.801338,118.802132,118.802277,118.802238,118.802208,118.80217,118.80217,118.802116,118.802116,118.802116,118.802116,118.802132,118.802132,118.802116,118.802063,118.80175,118.801285,118.801109,118.801033,118.800888,118.800774,118.800728,118.800591,118.800446,118.800156,118.800064,118.799721,118.799667,118.799583,118.799446,118.799339,118.799286,118.799179,118.799026,118.799004,118.798889,118.798676,118.798569,118.798454,118.798309,118.798332,118.798119,118.798073,118.797867,118.796928,118.796913,118.796608,118.79641,118.796249,118.796143,118.796021,118.795982,118.795967,118.795952,118.795952,118.795975,118.796036,118.796051,118.796127,118.796265,118.796265,118.796249,118.796196,118.796059,118.795845,118.795761,118.795677,118.795578,118.795433,118.795227,118.795036,118.794853,118.794632,118.794373,118.794098,118.793747,118.79364,118.793419,118.792206,118.791351,118.790588,118.789413,118.788422,118.78788,118.787636,118.787422,118.787117,118.786774,118.786354,118.784454,118.783997,118.78373,118.783447,118.783302,118.783073,118.782936,118.782707,118.782448,118.782188,118.781906,118.781654,118.781563,118.781372,118.781212,118.781143,118.781075,118.781044,118.781021,118.781021,118.781006,118.780991,118.780991,118.781006,118.781075,118.781128,118.781166,118.781265,118.781334,118.781372,118.781441,118.781654,118.781815,118.782188,118.782654,118.782707,118.782799,118.782845,118.782883,118.782898,118.782913,118.782852,118.782776,118.782738,118.782692,118.782639,118.782616,118.78257,118.782532,118.782509,118.782486,118.78244,118.78244,118.782463,118.782547,118.782623,118.782661,118.782799,118.782875,118.783073,118.783646,118.78421,118.784447,118.784615,118.785034,118.785309,118.786087,118.786301,118.786659,118.786758,118.787033,118.787148,118.788521,118.790497,118.790833,118.791023,118.792114,118.792656,118.792885,118.793266,118.793594,118.794128,118.79425,118.794594,118.794617,118.794739,118.794861,118.794975,118.795105,118.79538,118.795403,118.795471,118.795502,118.795578,118.795746,118.795799,118.795853,118.795868,118.795883,118.795914,118.795937,118.795967,118.796021,118.796036,118.796082,118.796097,118.796104,118.796112,118.796143,118.796234,118.796265,118.796288,118.796356,118.796371,118.796371,118.796387,118.796387,118.796455,118.796494,118.796547,118.796608,118.796661,118.796753,118.796852,118.79689,118.796982,118.797234,118.797585,118.797882,118.798279,118.798615,118.798981,118.799431,118.799873,118.800446,118.800919,118.801369,118.801773,118.802162,118.802185,118.80246,118.803101,118.803551,118.803833,118.804375,118.805573,118.806267,118.806976,118.809288,118.809502,118.809723,118.810471,118.811005,118.81134,118.811707,118.812447,118.812904,118.813263,118.81366,118.813835,118.814003,118.814575,118.814964,118.815224,118.815575,118.81575,118.81588,118.816216,118.816444,118.816574,118.816788,118.817047,118.817223,118.817566,118.817719,118.817863,118.818024,118.818153,118.81823,118.818344,118.81842,118.818459,118.818481,118.818504,118.818535,118.818558,118.818604,118.818611,118.818672,118.81868,118.818748,118.818825,118.818886,118.818977,118.819046,118.81913,118.819237,118.819305,118.819656,118.819916,118.820084,118.820206,118.820274,118.820328,118.820557,118.820679,118.8209,118.820915,118.820938,118.821442,118.821999,118.822464,118.822876,118.823257,118.823631,118.824142,118.824532,118.82486,118.825485,118.826035,118.826736,118.827202,118.827744,118.828697,118.829475,118.830368,118.831451,118.832207,118.833458,118.835037,118.83609,118.836906,118.855148,118.855728,118.85685,118.857826,118.858582,118.858955,118.859367,118.860779,118.862259,118.865471,118.87059,118.876595,118.878799,118.880005,118.880867,118.882202,118.882828,118.883835,118.884583,118.885414,118.88604,118.886856,118.887779,118.888481,118.88932,118.890114,118.891235,118.891754,118.892029,118.892448,118.892937,118.893837,118.89415,118.894882,118.895363,118.895714,118.895828,118.895912,118.895988,118.896034,118.896332,118.896385,118.896423,118.896423,118.896423,118.896385,118.896339,118.896271,118.896164,118.896042,118.895866,118.895714,118.895515,118.895309,118.895035,118.894791,118.894569,118.894272,118.893959,118.893593,118.893234,118.892731,118.892227,118.890732,118.885399,118.884392,118.882797,118.880005,118.879807,118.87854,118.878113,118.878014,118.877846,118.87764,118.87748,118.877327,118.876877,118.876701,118.876434,118.876404,118.876266,118.876122,118.875992,118.875862,118.875694,118.874184,118.873924,118.873779,118.873695,118.87365,118.873596,118.873573,118.873558,118.873596,118.873657,118.873764,118.873978,118.874397,118.874634,118.874741,118.874962,118.875168,118.87545,118.875687,118.875877,118.876129,118.876244,118.876411,118.876595,118.876633",
          "118.876839,118.877029,118.877167,118.877205,118.877411,118.877892,118.877998,118.87809,118.878174,118.878265,118.878334,118.878365,118.878387,118.878387,118.878365,118.878365,118.878296,118.878212,118.878212,118.878212,118.878265,118.878319,118.878387,118.878464,118.878555,118.878639,118.878677,118.878754,118.878868,118.879013,118.879219,118.879715,118.879837,118.879898,118.880005,118.882896,118.884506,118.885483,118.890488,118.890778,118.891838,118.893265,118.893921,118.894218,118.894455,118.894913,118.895187,118.895409,118.895592,118.895905,118.896042,118.896179,118.896294,118.896385,118.896492,118.896545,118.896591,118.896606,118.896606,118.896492,118.896385,118.896271,118.895935,118.895706,118.895287,118.8946,118.894073,118.893417,118.892746,118.892303,118.8918,118.889923,118.889618,118.888664,118.887016,118.885574,118.884758,118.88401,118.883354,118.882355,118.880989,118.880005,118.879166,118.878052,118.877319,118.876579,118.870262,118.865593,118.861984,118.860504,118.859085,118.858727,118.857964,118.857239,118.85659,118.855888,118.855324,118.84935,118.848038,118.840385,118.837257,118.836983,118.83625,118.835205,118.834587,118.83387,118.833076,118.832642,118.831612,118.830536,118.830261,118.829651,118.828873,118.82843,118.827927,118.827393,118.826927,118.825905,118.825432,118.82505,118.824722,118.824333,118.823822,118.823067,118.82267,118.822205,118.821861,118.821663,118.821144,118.821121,118.820999,118.820763,118.820419,118.820038,118.819862,118.819672,118.819534,118.819344,118.819237,118.819183,118.819038,118.818871,118.818863,118.818817,118.818802,118.818802,118.818764,118.818733,118.818718,118.81871,118.818695,118.81868,118.818665,118.818657,118.818626,118.818611,118.818588,118.818535,118.818489,118.818367,118.818314,118.818176,118.818008,118.817848,118.817642,118.81739,118.817116,118.816788,118.816589,118.816475,118.816109,118.816025,118.815437,118.81517,118.814705,118.814354,118.814285,118.81385,118.813507,118.813232,118.812881,118.8125,118.812134,118.811729,118.811096,118.810913,118.810432,118.809738,118.809715,118.809502,118.808975,118.807381,118.806473,118.805809,118.80526,118.804962,118.804176,118.803955,118.803749,118.803291,118.802536,118.801971,118.801071,118.800552,118.800201,118.799896,118.799774,118.799667,118.799355,118.799271,118.798729,118.7985,118.798317,118.798058,118.797867,118.797653,118.797585,118.797447,118.797356,118.797203,118.797165,118.796928,118.796875,118.796768,118.796745,118.796631,118.7966,118.796555,118.796494,118.796303,118.796265,118.796249,118.796181,118.796181,118.796104,118.796059,118.796005,118.795967,118.795677,118.795555,118.795486,118.795403,118.795135,118.794998,118.794785,118.794685,118.794182,118.793907,118.793709,118.793419,118.793297,118.793182,118.792709,118.792274,118.792015,118.79126,118.791039,118.79068,118.790115,118.789772,118.789055,118.788742,118.787354,118.787094,118.78701,118.786705,118.786591,118.786331,118.786201,118.786041,118.785797,118.785362,118.784981,118.784912,118.784264,118.783836,118.783852,118.783829,118.783821,118.783806,118.783813,118.783836,118.783859,118.78389,118.783951,118.783997,118.784081,118.784126,118.784218,118.784302,118.784462,118.784706,118.784927,118.785049,118.7854,118.78566,118.785965,118.786285,118.786369,118.786438,118.787857,118.788177,118.789124,118.789772,118.790329,118.79071,118.791855,118.792099,118.792191,118.792343,118.792465,118.792633,118.792755,118.792885,118.792984,118.793121,118.793968,118.79406,118.794273,118.794525,118.794708,118.794792,118.794922,118.795067,118.79528,118.795418,118.796822,118.796822,118.797134,118.79805,118.798225,118.798576,118.798815,118.798964,118.799016,118.799033,118.799032,118.799037,118.799,118.798847,118.798593,118.798553,118.798606,118.798795,118.798993,118.799221,118.799581,118.799688,118.801214,118.801893,118.801895,118.802116,118.802811,118.802813,118.803593,118.803995,118.804384,118.805401,118.805397,118.805763,118.805939,118.806198,118.806374,118.806526,118.806648,118.806786,118.807014,118.807205,118.807289,118.807381,118.80748,118.807518,118.807571,118.807625,118.807686,118.807709,118.807709,118.807671,118.807625,118.807533,118.807434,118.807266,118.807098,118.806877,118.806664,118.806129,118.805931,118.805934,118.804722,118.803842,118.802973,118.801289,118.800388,118.799789,118.799408,118.797546,118.797379,118.797089,118.796921,118.796417,118.796349,118.796005,118.79583,118.795753,118.795702,118.795498,118.79526,118.794828,118.793889,118.789552,118.788291,118.787435,118.786676,118.786422,118.786148,118.785335,118.784434,118.784101,118.783726,118.78344,118.782927,118.781918,118.78189,118.7866,118.786632,118.78307,118.782201,118.781826,118.78115,118.780506,118.77997,118.779315,118.777743,118.776998,118.776787,118.776688,118.775917,118.775459,118.775024,118.77475,118.77446,118.77433,118.771049,118.770073,118.769836,118.769081,118.768509,118.768272,118.767761,118.767433,118.76709,118.766747,118.766411,118.766258,118.766083,118.76593,118.765862,118.76577,118.765686,118.765633,118.76561,118.765549,118.765823,118.766006,118.76609,118.766296,118.766571,118.766891,118.767036,118.767189,118.76741,118.767517,118.767761,118.767899,118.767975,118.768051,118.768112,118.768143,118.768143,118.768196,118.76825,118.768341,118.768402,118.768486,118.768669,118.76886,118.768974,118.76918,118.769188,118.769279,118.76931,118.769341,118.769394,118.769417,118.769424,118.769432,118.76944,118.769478,118.769554,118.769753,118.769768,118.769821,118.769836,118.769836,118.769821,118.769814,118.769775,118.769722,118.769592,118.769501,118.769394,118.769371,118.769135,118.769058,118.768944,118.768623,118.768478,118.768295,118.767815,118.767387,118.767174,118.766739,118.766617,118.766495,118.766258,118.765999,118.766518,118.766869,118.767136,118.767342,118.767532,118.767792,118.768143,118.768974,118.770531,118.770935,118.771637,118.771545,118.770935,118.770546,118.768967,118.768234,118.767654,118.767357,118.767365,118.767357,118.767334,118.766914,118.766594,118.766418,118.765884,118.765678,118.764259,118.763527,118.763481,118.763161,118.762207,118.762093,118.761436,118.760681,118.760109,118.759567,118.758865,118.758415,118.758179,118.757866,118.757721,118.757652,118.757469,118.757462,118.757019,118.756859,118.756424,118.755753,118.755219,118.754951,118.754456,118.753693,118.753586,118.753052,118.753036,118.752876,118.752861,118.75248,118.752388,118.752037,118.750954,118.750381,118.750061,118.749947,118.749908,118.749039,118.748543,118.748192,118.748001,118.747841,118.747704,118.746925,118.745209,118.744453,118.744339,118.741982,118.741478,118.740921,118.740234,118.739197,118.738701,118.738213,118.738228,118.738251,118.738251,118.738266,118.738358,118.738525,118.738533,118.738632",
          "118.738032,118.738486,118.738567,118.738652,118.73877,118.738777,118.738785,118.738937,118.739098,118.739166,118.739212,118.739235,118.739235,118.739182,118.739136,118.738823,118.738785,118.738647,118.738617,118.738632,118.738617,118.738541,118.738457,118.738388,118.738319,118.738319,118.738297,118.738533,118.738991,118.740677,118.740738,118.741806,118.741806,118.741913,118.742104,118.743248,118.743805,118.744934,118.745102,118.749229,118.750114,118.75222,118.754089,118.755219,118.755333,118.758575,118.759079,118.759758,118.760574,118.761543,118.761665,118.761925,118.762901,118.763489,118.763489,118.763664,118.764076,118.764427,118.765053,118.765327,118.765877,118.766457,118.766647,118.766808,118.766922,118.766998,118.767494,118.768227,118.769066,118.769325,118.770393,118.774323,118.776711,118.779198,118.77993,118.780479,118.78096,118.781433,118.781967,118.782761,118.783302,118.786301,118.786804,118.786835,118.786835,118.787933,118.789604,118.789604,118.792076,118.793556,118.793976,118.793976,118.794357,118.794708,118.794861,118.795036,118.795288,118.79538,118.795502,118.795654,118.795731,118.795776,118.79586,118.795883,118.795937,118.796005,118.796021,118.796127,118.796181,118.796181,118.796181,118.796181,118.796181,118.796165,118.796074,118.795853,118.795776,118.795685,118.795593,118.795433,118.795433,118.795227,118.795036,118.794861,118.794632,118.79438,118.794098,118.793762,118.793648,118.793427,118.792587,118.79258,118.792213,118.791351,118.790588,118.789413,118.788422,118.787888,118.787651,118.78743,118.787117,118.786774,118.786484,118.785973,118.784462,118.783997,118.78373,118.783455,118.783302,118.783073,118.782936,118.782707,118.782455,118.782196,118.781906,118.78167,118.781563,118.78138,118.781212,118.781143,118.781075,118.781044,118.781036,118.781021,118.781006,118.780998,118.780991,118.781006,118.781075,118.781128,118.781166,118.781265,118.781334,118.781372,118.781441,118.781609,118.781609,118.781654,118.781815,118.782188,118.782654,118.782707,118.782799,118.782845,118.782883,118.782898,118.782913,118.782867,118.782784,118.782745,118.7827,118.782639,118.782639,118.782501,118.78241,118.782379,118.782349,118.78228,118.782272,118.782196,118.78215,118.782066,118.78196,118.78196,118.781906,118.7817,118.781563,118.781509,118.781494,118.781494,118.781509,118.781548,118.781624,118.781715,118.781815,118.781822,118.781822,118.781944,118.782173,118.782303,118.782532,118.782684,118.782829,118.78302,118.783195,118.783386,118.783577,118.783852,118.784027,118.784142,118.784805,118.785088,118.7854,118.78566,118.785965,118.786285,118.786369,118.786438,118.787857,118.789124,118.790237,118.790451,118.790688,118.791023,118.79203,118.792366,118.792503,118.792709,118.792816,118.792931,118.793037,118.793213,118.793213,118.793831,118.793854,118.794235,118.794411,118.794601,118.794724,118.794724,118.794708,118.795052,118.795258,118.795258,118.795311,118.795349,118.795349,118.795357,118.795364,118.796371,118.796753,118.794342,118.793091,118.792831,118.792793,118.79248,118.792252,118.791809,118.790993,118.790192,118.789963,118.789772,118.788673,118.788246,118.787933,118.787666,118.786858,118.78656,118.786095,118.785431,118.783493,118.783058,118.78257,118.782547,118.782448,118.782394,118.782318,118.782295,118.782303,118.782257,118.782249,118.782257,118.782295,118.782326,118.782425,118.782585,118.782707,118.782936,118.783379,118.783508,118.784111,118.784447,118.784706,118.785049,118.785156,118.785538,118.785721,118.786598,118.787567,118.788071,118.788261,118.788666,118.789375,118.789757,118.789932,118.790359,118.790497,118.790833,118.791023,118.792114,118.792656,118.792885,118.793266,118.793594,118.794128,118.79425,118.794594,118.794617,118.794739,118.794861,118.794975,118.795105,118.79538,118.795403,118.795471,118.795502,118.795578,118.795746,118.795799,118.795853,118.795868,118.795906,118.795937,118.795967,118.796021,118.796036,118.796082,118.796097,118.796104,118.796112,118.796143,118.796234,118.796265,118.796288,118.796356,118.796371,118.796371,118.796387,118.796387,118.796455,118.796494,118.796547,118.796608,118.796661,118.796753,118.796852,118.79689,118.796982,118.797234,118.797585,118.797882,118.798279,118.798615,118.798981,118.799431,118.799873,118.800446,118.800919,118.801369,118.801773,118.802162,118.802185,118.80246,118.803101,118.803551,118.803833,118.804375,118.805573,118.806267,118.806976,118.809288,118.809471,118.809723,118.810471,118.811005,118.81134,118.811707,118.812447,118.812904,118.813263,118.81366,118.813835,118.814003,118.814575,118.814964,118.815224,118.815575,118.81575,118.81588,118.816216,118.816444,118.816574,118.816788,118.817047,118.817223,118.817566,118.817719,118.817863,118.818024,118.818153,118.81823,118.818344,118.81842,118.818459,118.818481,118.818504,118.818535,118.818558,118.818604,118.818611,118.818672,118.81868,118.818748,118.818825,118.818886,118.818977,118.819046,118.81913,118.819237,118.819305,118.819656,118.819916,118.820084,118.820206,118.820274,118.820328,118.820557,118.820679,118.8209,118.820915,118.820938,118.821442,118.821999,118.822464,118.822876,118.823257,118.823631,118.824142,118.824532,118.82486,118.825485,118.826035,118.826736,118.827202,118.827744,118.828697,118.829475,118.830368,118.831451,118.832207,118.833458,118.835037,118.83609,118.836906,118.855148,118.855728,118.85685,118.857826,118.858582,118.858955,118.859367,118.860779,118.862259,118.865471,118.87059,118.876595,118.878799,118.880005,118.880867,118.882202,118.882828,118.883835,118.884583,118.885414,118.88604,118.886856,118.887779,118.888481,118.88932,118.890114,118.891235,118.891754,118.892029,118.892448,118.892937,118.893837,118.89415,118.894882,118.895363,118.895714,118.895828,118.895973,118.896126,118.896332,118.896385,118.896423,118.896423,118.896423,118.896385,118.896339,118.896271,118.896164,118.896042,118.895813,118.895714,118.895515,118.895309,118.895035,118.894791,118.894569,118.894272,118.893959,118.893593,118.893234,118.892845,118.891716,118.890732,118.885399,118.884392,118.882797,118.880005,118.879807,118.87854,118.878113,118.878014,118.877846,118.87764,118.87748,118.877327,118.876877,118.876701,118.876434,118.876404,118.876266,118.876122,118.875992,118.875862,118.875694,118.874184,118.873924,118.873779,118.873695,118.87365,118.873596,118.873573,118.873558,118.873596,118.873657,118.873764,118.873978,118.874397,118.874634,118.874741,118.874962,118.875168,118.87545,118.875687,118.875877,118.876129,118.876244,118.876411,118.876595,118.876823,118.876839"
        ],
        //0、 1号线 机场-南京南站 1、 1号线 南京南站-机场 2、 2号线 机场-河西万达广场 3、 2号线 河西万达广场-机场
        ys:[
          "31.731215,31.731346,31.731554,31.731724,31.732018,31.732244,31.73246,31.732904,31.733194,31.733511,31.733828,31.734137,31.734354,31.734592,31.734783,31.735117,31.735447,31.735582,31.735821,31.736002,31.736229,31.736397,31.736532,31.736637,31.736692,31.736727,31.736774,31.736906,31.73704,31.737141,31.737267,31.737652,31.737822,31.73789,31.739401,31.740265,31.740795,31.741453,31.743624,31.744774,31.745117,31.745352,31.745747,31.746311,31.74678,31.747284,31.747799,31.747877,31.748169,31.748489,31.748949,31.749691,31.750238,31.750841,31.750938,31.751541,31.751966,31.752583,31.752747,31.752991,31.753229,31.753712,31.754131,31.75493,31.756186,31.757057,31.758125,31.759157,31.760695,31.760695,31.762938,31.76326,31.763594,31.764479,31.766264,31.767717,31.768497,31.769188,31.769766,31.77063,31.771727,31.772488,31.773108,31.773907,31.77441,31.774897,31.77891,31.781862,31.783949,31.784813,31.785183,31.786215,31.786493,31.787092,31.787674,31.788221,31.788824,31.789331,31.794834,31.796055,31.803102,31.805981,31.806246,31.806957,31.808016,31.808659,31.809423,31.810322,31.810816,31.81204,31.813402,31.813759,31.814569,31.815668,31.816311,31.817066,31.817886,31.818624,31.820347,31.82119,31.821901,31.822531,31.82332,31.824389,31.826073,31.827023,31.828224,31.829176,31.829683,31.831255,31.831341,31.831732,31.832552,31.833797,31.835352,31.836159,31.837101,31.837856,31.83898,31.839649,31.839966,31.841242,31.842865,31.843035,31.843777,31.843954,31.843988,31.84487,31.845516,31.846272,31.847031,31.847527,31.848125,31.848372,31.848623,31.849127,31.849396,31.849844,31.850443,31.850882,31.8519,31.852379,31.853308,31.854267,31.855087,31.856142,31.857204,31.858238,31.859358,31.860001,31.860365,31.861471,31.861727,31.863224,31.86385,31.864901,31.865694,31.865833,31.866714,31.867382,31.867922,31.868546,31.869219,31.869471,31.870226,31.871529,31.872509,31.873503,31.873524,31.87381,31.874523,31.876627,31.877834,31.878702,31.879457,31.879883,31.881063,31.881384,31.88172,31.882456,31.883745,31.884775,31.886576,31.887691,31.888498,31.889214,31.889523,31.889795,31.890669,31.890863,31.892483,31.893238,31.89385,31.89484,31.895617,31.896566,31.896835,31.89757,31.898073,31.899019,31.89921,31.901033,31.901619,31.902895,31.903419,31.906124,31.907019,31.907621,31.909601,31.914604,31.915274,31.915754,31.917118,31.917557,31.91954,31.920034,31.920715,31.920977,31.92198,31.922661,31.925655,31.926744,31.927271,31.927929,31.92849,31.92849,31.929678,31.930347,31.931667,31.932201,31.934448,31.935591,31.936415,31.937922,31.938303,31.93951,31.941277,31.942039,31.945187,31.946194,31.947674,31.951532,31.952536,31.954344,31.955507,31.956249,31.956789,31.957453,31.957752,31.959076,31.960791,31.962349,31.963612,31.964428,31.965694,31.966085,31.966753,31.967239,31.968576,31.969236,31.969706,31.970135,31.970568,31.971077,31.971893,31.972197,31.972731,31.973419,31.974609,31.975624,31.977491,31.978308,31.97891,31.979227,31.979887,31.980173,31.980633,31.980782,31.981155,31.981384,31.98184,31.982718,31.982885,31.983685,31.984219,31.984396,31.984432,31.984484,31.985477,31.985512,31.985634,31.985743,31.986366,31.986975,31.987261,31.987513,31.988495,31.988697,31.98875,31.991974,31.992205,31.992249,31.992283,31.992327,31.992405,31.992401,31.992395,31.992395,31.992399,31.992399,31.992422,31.992474,31.992579,31.992647,31.992855,31.993361,31.993443,31.993752,31.993885,31.993984,31.994328,31.9949,31.995173,31.995405,31.995621,31.995819,31.996151,31.996363,31.996794,31.996981,31.99725,31.997568,31.997919,31.998091,31.998312,31.998716,31.998875,31.999149,31.999376,31.999701,31.999853,32.000069,32.001511,32.002998,32.003174,32.003555,32.00481,32.004925,32.005051,32.005337,32.006561,32.007271,32.007515,32.007755,32.00806,32.008156,32.00848,32.008675,32.008945,32.009586,32.009583,32.010914,32.010979,32.011913,32.01355,32.014156,32.014477,32.014568,32.014996,32.015934,32.016819,32.017277,32.017399,32.017792,32.018711,32.019531,32.019714,32.019787,32.019791,32.019787,32.020443,32.02058,32.020985,32.021366,32.02166,32.022243,32.022484,32.023254,32.023438,32.023949,32.025505,32.026142,32.026272,32.026844,32.027096,32.027393,32.027653,32.028099,32.028271,32.028553,32.029221,32.030212,32.030495,32.030766,32.031467,32.031872,32.032413,32.032516,32.033203,32.033897,32.034241,32.034744,32.034966,32.035412,32.035648,32.035912,32.036045,32.036488,32.036484,32.036915,32.039055,32.039879,32.040329,32.040478,32.04084,32.042179,32.042713,32.043072,32.043606,32.043781,32.044052,32.04562,32.04702,32.047802,32.048332,32.048943,32.049202,32.050354,32.05122,32.051479,32.05267,32.053509,32.054466,32.05637,32.057855,32.06093,32.062366,32.06298,32.063426,32.064162,32.064876,32.065162,32.065571,32.066167,32.066494,32.066972,32.067922,32.070149,32.071786,32.072167,32.072472,32.072717,32.073304,32.073527,32.073708,32.073922,32.074118,32.074608,32.074849,32.075063,32.075231,32.075495,32.075618,32.075745,32.075927,32.076004,32.076049,32.076159,32.076313,32.076509,32.076608,32.076668,32.076731,32.07679,32.076845,32.077054,32.077108,32.077154,32.077172,32.077168,32.07709,32.077063,32.077054,32.077095,32.077149,32.07729,32.077499,32.077677,32.077745,32.077845,32.077927,32.07799,32.078045,32.078095,32.078077,32.078036,32.077945,32.077827,32.078846,32.079708,32.080559,32.080688,32.081223,32.081455,32.081615,32.082146,32.082733,32.082863,32.083187,32.083405,32.083447,32.083542,32.083824,32.083923,32.084068,32.084076",
          "32.084152,32.084759,32.084412,32.084286,32.084087,32.084023,32.083927,32.083881,32.083775,32.083733,32.083679,32.083614,32.083549,32.083473,32.083393,32.083271,32.083164,32.082966,32.082924,32.082859,32.083031,32.083172,32.083031,32.082672,32.082554,32.081936,32.081367,32.081348,32.081223,32.080524,32.080463,32.078655,32.078545,32.07848,32.078407,32.078239,32.07803,32.077969,32.077911,32.077866,32.077808,32.077686,32.077641,32.077183,32.077148,32.076958,32.076965,32.077019,32.077065,32.077141,32.07724,32.077492,32.077633,32.077747,32.077785,32.077808,32.077812,32.077808,32.077797,32.077736,32.077686,32.077568,32.077496,32.077431,32.077362,32.077179,32.076199,32.075901,32.075439,32.075188,32.074718,32.07431,32.073849,32.073566,32.073387,32.073208,32.072769,32.072163,32.071987,32.071079,32.069519,32.067959,32.066891,32.066387,32.065784,32.065617,32.065353,32.064819,32.064285,32.064018,32.063755,32.063213,32.062679,32.061523,32.057549,32.056267,32.055569,32.054432,32.053562,32.052765,32.052315,32.051506,32.051228,32.050785,32.050434,32.049553,32.049118,32.045425,32.044094,32.043724,32.042999,32.041264,32.040466,32.040348,32.039093,32.036945,32.036064,32.035923,32.035683,32.035217,32.034809,32.034519,32.033394,32.032387,32.031998,32.031288,32.029118,32.028568,32.028255,32.027626,32.027271,32.02663,32.02639,32.026222,32.025925,32.025429,32.023136,32.022366,32.022232,32.021545,32.02137,32.021072,32.020046,32.019604,32.019535,32.019714,32.019772,32.020142,32.020321,32.020584,32.021046,32.020866,32.020771,32.02076,32.020527,32.020267,32.020058,32.019939,32.019531,32.019497,32.019447,32.019424,32.019341,32.019314,32.019291,32.01926,32.019272,32.01926,32.019196,32.019176,32.01915,32.01918,32.019203,32.019318,32.019405,32.019508,32.019535,32.019604,32.019375,32.019077,32.018471,32.018055,32.017883,32.01746,32.016998,32.016918,32.016602,32.016029,32.015926,32.015633,32.015205,32.015049,32.014465,32.014362,32.014046,32.01133,32.010891,32.010071,32.00948,32.009071,32.008728,32.008251,32.007999,32.007877,32.007637,32.007092,32.006428,32.005051,32.004807,32.002998,31.999769,31.999584,31.999367,31.999105,31.998728,31.998295,31.998125,31.997917,31.997696,31.997309,31.996866,31.996607,31.996389,31.996162,31.995934,31.99572,31.995504,31.995426,31.995317,31.99477,31.994396,31.994059,31.993525,31.993086,31.992865,31.992783,31.992722,31.992657,31.992609,31.992579,31.992592,31.992579,31.992552,31.9925,31.992466,31.992401,31.992352,31.992256,31.992126,31.991966,31.991741,31.991484,31.991364,31.991106,31.990751,31.990572,31.99033,31.990143,31.99,31.989935,31.989189,31.989075,31.988333,31.987812,31.987104,31.98674,31.98658,31.986086,31.985825,31.985689,31.985439,31.984713,31.984184,31.982964,31.981384,31.981159,31.980778,31.980421,31.980053,31.979757,31.97941,31.978411,31.977491,31.976992,31.976419,31.975643,31.975266,31.974756,31.974293,31.973946,31.973602,31.972656,31.97217,31.971537,31.970772,31.970308,31.970078,31.969536,31.969196,31.968542,31.966797,31.965061,31.964354,31.963799,31.962557,31.961714,31.959419,31.958776,31.957726,31.957375,31.956589,31.956224,31.952084,31.946142,31.945129,31.944527,31.941271,31.939548,31.938837,31.937487,31.936237,31.934032,31.933464,31.931784,31.931654,31.930977,31.930334,31.92964,31.92881,31.926727,31.926662,31.925982,31.925659,31.924519,31.92309,31.92198,31.920994,31.920734,31.920013,31.919531,31.91836,31.917738,31.916458,31.915899,31.914604,31.914375,31.914314,31.91395,31.913107,31.910891,31.910095,31.909601,31.907757,31.907026,31.906185,31.905876,31.90575,31.905056,31.904161,31.903072,31.902166,31.901537,31.900673,31.8999,31.89957,31.899019,31.897539,31.895889,31.894674,31.893211,31.892157,31.891041,31.889862,31.888741,31.887409,31.88641,31.885494,31.884722,31.883989,31.883959,31.883472,31.882374,31.881653,31.881197,31.880369,31.878689,31.877752,31.876841,31.873768,31.873468,31.873159,31.872084,31.871277,31.87076,31.870152,31.868902,31.868082,31.867405,31.86664,31.866285,31.86595,31.864717,31.863811,31.863173,31.862267,31.861814,31.861444,31.860451,31.85977,31.859341,31.858589,31.857695,31.856962,31.855473,31.85471,31.853889,31.852913,31.851936,31.851294,31.85014,31.849119,31.848372,31.847574,31.845856,31.845131,31.84441,31.84374,31.843702,31.842861,31.842739,31.841957,31.841228,31.840712,31.840027,31.839479,31.838959,31.838278,31.837891,31.836151,31.834944,31.834253,31.833759,31.833521,31.833303,31.832518,31.832088,31.831354,31.83131,31.831255,31.829683,31.828176,31.826965,31.826002,31.825117,31.82431,31.823252,31.82247,31.821831,31.820673,31.819723,31.818542,31.817791,31.816967,31.815559,31.81447,31.813316,31.811922,31.811024,31.809587,31.807899,31.806845,31.806059,31.789232,31.788706,31.787752,31.786949,31.786358,31.786072,31.785769,31.784758,31.783758,31.781719,31.778481,31.774666,31.773142,31.772247,31.771584,31.770491,31.769966,31.769075,31.768394,31.767599,31.766975,31.766142,31.765142,31.764353,31.763464,31.762526,31.760933,31.760191,31.759769,31.759211,31.75849,31.757061,31.756498,31.755257,31.754322,31.75362,31.753376,31.753147,31.752913,31.752773,31.751919,31.751562,31.751211,31.75086,31.750443,31.750044,31.749687,31.749332,31.748962,31.748632,31.748199,31.747877,31.747547,31.747234,31.746849,31.74655,31.746294,31.746012,31.745737,31.745447,31.745186,31.744865,31.744579,31.743776,31.740932,31.740398,31.73954,31.73805,31.737961,31.737278,31.737057,31.736948,31.736753,31.73645,31.736168,31.735865,31.734892,31.734491,31.73398,31.733932,31.733755,31.733572,31.733446,31.733341,31.733234,31.732422,31.732269,31.73217,31.732088,31.73201,31.731922,31.731836,31.731741,31.731562,31.731306,31.731228,31.731119,31.730951,31.730885,31.73085,31.73082,31.73082,31.730843,31.730885,31.730925,31.731007,31.73105,31.731112,31.731203,31.731224",
          "31.731363,31.731554,31.731724,31.732014,31.732214,31.732817,31.733004,31.733204,31.733372,31.733593,31.733833,31.734011,31.734276,31.734549,31.734743,31.734779,31.735113,31.735443,31.735834,31.736012,31.736229,31.736397,31.736532,31.736637,31.736727,31.736788,31.736853,31.736948,31.737066,31.737165,31.737295,31.73757,31.7377,31.737799,31.737856,31.739397,31.740248,31.740772,31.743437,31.743576,31.744127,31.744991,31.745478,31.745733,31.745955,31.74645,31.746767,31.747061,31.747335,31.747877,31.748142,31.748451,31.748789,31.74914,31.749571,31.749952,31.750278,31.75066,31.750841,31.752144,31.752518,31.753008,31.753712,31.754131,31.75493,31.756186,31.757057,31.758125,31.759157,31.760017,31.760725,31.76326,31.763594,31.764479,31.766264,31.767717,31.768497,31.769188,31.769766,31.77063,31.771727,31.772488,31.773108,31.773907,31.77441,31.774897,31.77891,31.781862,31.784153,31.785183,31.786215,31.786493,31.787092,31.787674,31.788221,31.788824,31.789331,31.794834,31.796055,31.803102,31.805981,31.806246,31.806957,31.808016,31.808659,31.809423,31.810322,31.810816,31.81204,31.813402,31.813759,31.814569,31.815668,31.816311,31.817066,31.817886,31.818624,31.820347,31.82119,31.821901,31.822531,31.82332,31.824389,31.826073,31.827023,31.828224,31.829176,31.829683,31.831255,31.831341,31.831732,31.832552,31.833797,31.835352,31.836159,31.837101,31.837856,31.83898,31.839649,31.839966,31.841242,31.842865,31.843035,31.843777,31.843954,31.843988,31.84487,31.845516,31.846272,31.847031,31.847527,31.848125,31.848372,31.848623,31.849127,31.849396,31.849844,31.850443,31.850882,31.8519,31.852379,31.853308,31.854267,31.855087,31.856142,31.857204,31.858238,31.859358,31.860001,31.860365,31.861471,31.861727,31.863224,31.86385,31.864901,31.865694,31.865833,31.866714,31.867382,31.867922,31.868546,31.869219,31.869862,31.870516,31.871529,31.871805,31.872509,31.873503,31.873524,31.87381,31.874523,31.876627,31.877834,31.878702,31.879457,31.879883,31.881063,31.881384,31.88172,31.882456,31.883745,31.884775,31.886576,31.887691,31.888498,31.889214,31.889523,31.889795,31.890669,31.890863,31.892483,31.893238,31.89385,31.89484,31.895617,31.896566,31.896835,31.89757,31.898073,31.899019,31.89921,31.901033,31.901619,31.902895,31.903419,31.906124,31.907019,31.907621,31.909601,31.914604,31.915274,31.915754,31.917118,31.917557,31.919683,31.920656,31.92198,31.922661,31.925655,31.926744,31.927271,31.927929,31.929678,31.930481,31.931667,31.932201,31.934448,31.935591,31.936415,31.937487,31.937922,31.938303,31.939882,31.941277,31.942039,31.944357,31.945017,31.94734,31.94911,31.950148,31.952309,31.953241,31.957447,31.95825,31.958498,31.959436,31.959726,31.960522,31.96089,31.961384,31.962078,31.963346,31.964384,31.964582,31.966459,31.967587,31.967674,31.967838,31.967882,31.968134,31.968277,31.968529,31.968676,31.968842,31.96904,31.969172,31.969379,31.969465,31.969631,31.969761,31.969982,31.970247,31.970461,31.970551,31.970778,31.970924,31.971071,31.971207,31.971251,31.971302,31.971472,31.971519,31.971663,31.971788,31.971819,31.971874,31.972115,31.972162,31.972162,31.972149,31.972118,31.972061,31.971996,31.971905,31.971806,31.971598,31.970278,31.970152,31.970005,31.969835,31.969765,31.96974,31.96973,31.969748,31.969801,31.9699,31.970551,31.970547,31.970694,31.971115,31.971146,31.971312,31.971504,31.971662,31.971751,31.971818,31.971878,31.972031,31.97217,31.972455,31.97289,31.97324,31.973543,31.973868,31.974096,31.97423,31.97441,31.974521,31.975129,31.97534,31.975325,31.975372,31.97563,31.975629,31.975955,31.97613,31.976271,31.976218,31.976198,31.97612,31.976093,31.976076,31.976086,31.976107,31.976141,31.976194,31.976315,31.976467,31.976545,31.976641,31.976797,31.976841,31.976944,31.977079,31.977283,31.97747,31.977621,31.977804,31.977982,31.978178,31.978321,31.978481,31.978594,31.978716,31.978788,31.978951,31.97901,31.979021,31.97944,31.980077,31.981351,31.983735,31.984864,31.986181,31.98675,31.989595,31.98984,31.990217,31.99036,31.99115,31.991268,31.991776,31.991993,31.992065,31.992122,31.992338,31.992577,31.992961,31.993537,31.995327,31.996005,31.99661,31.997538,31.997888,31.998346,31.999997,32.001876,32.002536,32.002972,32.003283,32.003618,32.00421,32.005761,32.005515,32.005733,32.006043,32.006188,32.006206,32.006297,32.006452,32.006598,32.006771,32.007225,32.007435,32.00737,32.007401,32.007603,32.007744,32.007885,32.007969,32.008041,32.008095,32.009022,32.009254,32.009319,32.009544,32.009731,32.009808,32.010014,32.010151,32.010315,32.010506,32.010708,32.010811,32.010952,32.011093,32.011177,32.011303,32.011459,32.011635,32.011726,32.01218,32.012901,32.013386,32.013611,32.014156,32.0149,32.01572,32.01609,32.016453,32.017021,32.017307,32.017895,32.018272,32.018539,32.018841,32.019157,32.019276,32.019341,32.019657,32.019978,32.020817,32.021198,32.021637,32.022396,32.023201,32.023792,32.025116,32.025143,32.025852,32.026257,32.026722,32.027416,32.0275,32.027576,32.027775,32.027966,32.028217,32.028976,32.029953,32.03009,32.030487,32.030849,32.031116,32.031525,32.031612,32.031887,32.032253,32.032955,32.033527,32.034348,32.034435,32.035778,32.036133,32.03661,32.037445,32.037746,32.038113,32.039005,32.039841,32.040211,32.040977,32.041183,32.041397,32.041821,32.04224,32.042534,32.042686,32.042778,32.042828,32.042843,32.042843,32.042824,32.042759,32.042652,32.042622,32.042545,32.042591,32.042652,32.042683,32.042816,32.042873,32.042912,32.042896,32.0429,32.042896,32.042896,32.042809,32.042694,32.042625,32.042435,32.042339,32.041668,32.041302,32.041283,32.041103,32.040482,32.040413,32.039982,32.039486,32.039101,32.038734,32.038265,32.037968,32.037823,32.037674,32.037628,32.037605,32.037575,32.037567,32.037537,32.03754,32.037601,32.037674,32.037735,32.037766,32.03783,32.037945,32.037876,32.036533,32.036514,32.036133,32.036095,32.035206,32.034977,32.034119,32.034355,32.034485,32.034557,32.034588,32.034592,32.034794,32.034916,32.035004,32.035053,32.035072,32.035072,32.035015,32.034847,32.034779,32.034767,32.034595,32.034565,32.034523,32.034462,32.034367,32.034332,32.034142,32.034035,32.033939,32.033894,32.033848,32.033314,32.032452,32.032406,32.031868",
          "32.031667,32.03167,32.031629,32.031624,32.031033,32.031029,32.030998,32.030304,32.029488,32.029049,32.028946,32.028191,32.028095,32.027699,32.027225,32.025475,32.025265,32.024509,32.024212,32.023808,32.023724,32.022957,32.022522,32.02224,32.021915,32.021912,32.021843,32.021633,32.021534,32.021099,32.021042,32.02076,32.020756,32.020756,32.020699,32.020294,32.020061,32.019539,32.019524,32.017693,32.017288,32.016296,32.015469,32.014988,32.014938,32.013554,32.013382,32.013138,32.012886,32.012661,32.012661,32.012623,32.012394,32.012241,32.012234,32.01215,32.011959,32.01178,32.011402,32.011211,32.010807,32.010406,32.0103,32.010212,32.010136,32.010113,32.009903,32.009636,32.009361,32.009289,32.00898,32.007851,32.007172,32.006454,32.006256,32.00613,32.006039,32.005959,32.00589,32.005821,32.005791,32.0056,32.005566,32.005558,32.005554,32.005459,32.005325,32.005322,32.005138,32.005043,32.005001,32.004997,32.004948,32.004883,32.004822,32.004749,32.004578,32.004501,32.004391,32.0042,32.00407,32.003975,32.003742,32.003563,32.00312,32.001949,32.001797,32.001038,32.000252,32.000122,31.999775,31.999701,31.999575,31.999466,31.998972,31.998299,31.998129,31.997921,31.9977,31.997313,31.997309,31.99687,31.996611,31.996393,31.996168,31.995937,31.995726,31.995508,31.99543,31.995321,31.99494,31.994934,31.994774,31.994402,31.994062,31.993528,31.99309,31.992868,31.992786,31.992725,31.992661,31.992613,31.992592,31.992586,31.992592,31.992582,31.992556,31.992504,31.99247,31.992405,31.992357,31.992262,31.99213,31.99197,31.991745,31.991489,31.991367,31.991112,31.990755,31.990578,31.990334,31.990147,31.990004,31.989939,31.989193,31.98908,31.988338,31.987818,31.98711,31.986744,31.986584,31.98609,31.985828,31.985695,31.985443,31.984888,31.984882,31.984718,31.984188,31.982969,31.981388,31.981163,31.980782,31.980425,31.980057,31.979761,31.979414,31.978416,31.977495,31.976997,31.976423,31.975647,31.975643,31.975239,31.974918,31.974731,31.974571,31.97352,31.973516,31.973364,31.973228,31.972878,31.972496,31.972492,31.97233,31.971796,31.971397,31.971197,31.971037,31.970846,31.970716,31.970577,31.970413,31.970251,31.970135,31.970118,31.970114,31.969999,31.969843,31.969774,31.969683,31.969648,31.969627,31.96961,31.96961,31.969631,31.969669,31.969778,31.969879,31.969952,31.970465,31.970659,31.970778,31.970924,31.971071,31.971207,31.971251,31.971302,31.971472,31.971663,31.971867,31.971874,31.971905,31.971966,31.972143,31.972078,31.972048,31.971931,31.971853,31.971745,31.971605,31.971333,31.971329,31.970373,31.970346,31.969822,31.969618,31.969461,31.969406,31.9694,31.96924,31.968658,31.968342,31.968338,31.96826,31.968189,31.968185,31.968185,31.968185,31.966589,31.965973,31.965256,31.967249,31.967644,31.967716,31.968304,31.968658,31.969322,31.970377,31.971458,31.971788,31.972105,31.974253,31.975109,31.975685,31.976212,31.977808,31.977961,31.977859,31.977739,31.977482,31.977423,31.977158,31.97694,31.975876,31.974918,31.974054,31.973595,31.97336,31.972843,31.971918,31.971724,31.97118,31.970812,31.970104,31.969284,31.968771,31.96777,31.966393,31.966007,31.964197,31.9632,31.9624,31.961353,31.961012,31.959869,31.959335,31.956718,31.953775,31.952284,31.951675,31.950512,31.94849,31.947708,31.947323,31.946381,31.946142,31.945129,31.944527,31.941271,31.939548,31.938837,31.937487,31.936237,31.934032,31.933464,31.931784,31.931654,31.930977,31.930334,31.92964,31.92881,31.926727,31.926662,31.925982,31.925659,31.924519,31.92309,31.92198,31.920994,31.920734,31.919786,31.91836,31.917738,31.916458,31.915899,31.914604,31.914375,31.914314,31.91395,31.913107,31.910891,31.910095,31.909601,31.907757,31.907026,31.906185,31.905876,31.90575,31.905056,31.904161,31.903072,31.902166,31.901537,31.900673,31.8999,31.89957,31.899019,31.897539,31.895889,31.894674,31.893211,31.892157,31.891041,31.889862,31.888741,31.887409,31.88641,31.885494,31.884722,31.883989,31.883959,31.883472,31.882374,31.881653,31.881197,31.880369,31.878689,31.877752,31.876841,31.873768,31.873516,31.873159,31.872084,31.871277,31.87076,31.870152,31.868902,31.868082,31.867405,31.86664,31.866285,31.86595,31.864717,31.863811,31.863173,31.862267,31.861814,31.861444,31.860451,31.85977,31.859341,31.858589,31.857695,31.856962,31.855473,31.85471,31.853889,31.852913,31.851936,31.851294,31.85014,31.849119,31.848372,31.847574,31.845856,31.845131,31.84441,31.84374,31.843702,31.842861,31.842739,31.841957,31.841228,31.840712,31.840027,31.839479,31.838959,31.838278,31.837891,31.836151,31.834944,31.834253,31.833759,31.833521,31.833303,31.832518,31.832088,31.831354,31.83131,31.831255,31.829683,31.828176,31.826965,31.826002,31.825117,31.82431,31.823252,31.82247,31.821831,31.820673,31.819723,31.818542,31.817791,31.816967,31.815559,31.81447,31.813316,31.811922,31.811024,31.809587,31.807899,31.806845,31.806059,31.789232,31.788706,31.787752,31.786949,31.786358,31.786072,31.785769,31.784758,31.783758,31.781719,31.778481,31.774666,31.773142,31.772247,31.771584,31.770491,31.769966,31.769075,31.768394,31.767599,31.766975,31.766142,31.765142,31.764353,31.763464,31.762526,31.760933,31.760191,31.759769,31.759211,31.75849,31.757061,31.756498,31.755257,31.754322,31.75362,31.753376,31.752956,31.752495,31.751919,31.751562,31.751211,31.75086,31.750443,31.750044,31.749687,31.749332,31.748962,31.748632,31.748108,31.747877,31.747547,31.747234,31.746849,31.74655,31.746294,31.746012,31.745737,31.745447,31.745186,31.744934,31.744301,31.743776,31.740932,31.740398,31.73954,31.73805,31.737961,31.737278,31.737057,31.736948,31.736753,31.73645,31.736168,31.735865,31.734892,31.734491,31.73398,31.733932,31.733755,31.733572,31.733446,31.733341,31.733234,31.732422,31.732269,31.73217,31.732088,31.73201,31.731922,31.731836,31.731741,31.731562,31.731306,31.731228,31.731119,31.730951,31.730885,31.73085,31.73082,31.73082,31.730843,31.730885,31.730925,31.731007,31.73105,31.731112,31.731203,31.731346,31.731358"
        ],
        txs:"",
        tys:"",
        map:{},
        line:[],
        lineNum:0,
        userPosition:[],
        hasPosition:false,
      }
    },
    mounted() {
      axios.get("http://restapi.amap.com/v3/distance?key=c34482d0838eb0252c7033f73b84e957&origins=118.882645,32.085517&destination=118.798576,32.084152&type=2").then((response)=>{
        console.log(response);
      }).catch((err)=>{
        console.log(err);
      })

      if(sessionStorage.getItem("userPosition")){

        this.userPosition = sessionStorage.getItem("userPosition").split(",");

        this.hasPosition = true;


      }else{
        Toast('未获取到用户坐标');
      }

      this.swiper = new swiper('.swiper-container', {
        autoplay: false,//可选选项，自动滑动
        on:
        {
          slideChangeTransitionEnd: () => {
            this.point = "南京火车站"
            this.lineNum = this.swiper.activeIndex;
            this.map.clearMap();
            if(this.swiper.activeIndex == 0){
              //1号线
              if(this.$route.params.direction=="D"){
                this.txs = this.xs[1];
                this.tys = this.ys[1];
              }else if(this.$route.params.direction=="A"){
                this.txs = this.xs[0];
                this.tys = this.ys[0];
              }

              this.markers[direction=="D"?1:0].forEach((marker)=> {
                let Mark = new AMap.Marker({
                  map: this.map,
                  icon: marker.icon,
                  position: marker.xy_coords.split(";"),
                  offset: new AMap.Pixel(-8, -8),
                })
                Mark.on('click',()=>{
                  this.map.panTo(marker.xy_coords.split(";"));
                  this.point = marker.name
                })

              });
            }else{
              //2号线
              this.point = "河西万达广场"
              if(this.$route.params.direction=="D"){
                this.txs = this.xs[3];
                this.tys = this.ys[3];
              }else if(this.$route.params.direction=="A"){
                this.txs = this.xs[2];
                this.tys = this.ys[2];
              }

              this.markers[direction=="D"?3:2].forEach((marker)=> {
                let Mark = new AMap.Marker({
                  map: this.map,
                  icon: marker.icon,
                  position: marker.xy_coords.split(";"),
                  offset: new AMap.Pixel(-8, -8),
                })
                Mark.on('click',()=>{
                  this.map.panTo(marker.xy_coords.split(";"));
                  this.point = marker.name
                })

              });
            }

            this.txs = this.txs.split(',');
            this.tys = this.tys.split(',');

            this.line = [];
            for (let i = 0;i<this.tys.length;i++){
              this.line.push([this.txs[i],this.tys[i]]);
            }
            let polyline = new AMap.Polyline({
              path: this.line,          //设置线覆盖物路径
              strokeColor: "#25C2F2", //线颜色
              strokeOpacity: 1,       //线透明度
              strokeWeight: 4,        //线宽
              strokeStyle: "solid",   //线样式
              strokeDasharray: [10, 5] //补充线样式
            });
            polyline.setMap(this.map);
          },
        }
      })

      axios.post('/eport-server/airFlight/getAirFlight.do',{
        "isFirst":"0",
        "countryType":"",
        "serviceType":"",
        "direction":this.$route.params.direction,
        "airportCode":"",
        "airlineCode":"",
        "flightIdentity":this.$route.params.flight,
        "pageSize":"1",
        "pageNumber":"1",
        userId:""
      }).then((response)=> {
        this.list = response.data.data.list[0];
      }).catch((error)=> {

      });

      let direction = this.$route.params.direction;

      this.init(direction);


    },
    methods: {
      toStopDetail(){
        //停车场详情
        window.open("http://222.190.243.8:8080/H5/StopDetail.html");
      },
      //主页进入切换页面
      homeChange(){
        if(this.$route.params.direction=="D"){
          this.$router.replace({path:'/flight/busLineA/0/A'});
        }else{
          this.$router.replace({path:'/flight/busLineD/0/D'});
        }
      },
      //选择停车场
      changeStop(id){
        this.stop = id;
        let x,y;
        if(id == 1){
          x = 118.872803;
          y = 31.735721;
        }else{
          x = 118.875893;
          y = 31.732454;
        }
        if(this.hasPosition){
          $('#panel2').html("");
          let driving = new AMap.Driving({
            map: this.map,
            panel: "panel2"
          });
          // 根据起终点名称规划驾车导航路线
          driving.search(
            new AMap.LngLat(this.userPosition[0],this.userPosition[1]),
            new AMap.LngLat(x,y)
          );
        }else{
          $('#panel2').html("");
          let driving = new AMap.Driving({
            map: this.map,
            panel: "panel2"
          });
          // 根据起终点名称规划驾车导航路线

          if(this.ss.poi.name == ""){
            Toast("请输入出发地");
            return;
          }

          driving.search([
            {keyword: this.ss.poi.name,city:'南京'},
            {keyword: this.stop=='1'?'南京禄口国际机场1号停车场':'南京禄口国际机场2号停车场',city:'南京'}
          ]);
        }
      },
      //选择模式
      changepage(id){
        this.showStation = false;
        this.pageShow = id;
        if(id == 1){
          this.map.clearMap();

          let polyline = new AMap.Polyline({
            path: this.line,          //设置线覆盖物路径
            strokeColor: "#25C2F2", //线颜色
            strokeOpacity: 1,       //线透明度
            strokeWeight: 4,        //线宽
            strokeStyle: "solid",   //线样式
            strokeDasharray: [10, 5] //补充线样式
          });
          polyline.setMap(this.map);
          let pageMark = [];
          if(this.lineNum==0){
            if(this.$route.params.direction == "A"){
              pageMark = this.markers[0];
            }else{
              pageMark = this.markers[1];
            }
          }else{
            if(this.$route.params.direction == "A"){
              pageMark = this.markers[2];
            }else{
              pageMark = this.markers[3];
            }
          }
          pageMark.forEach((marker)=> {
            let Mark = new AMap.Marker({
              map: this.map,
              icon: marker.icon,
              position: marker.xy_coords.split(';'),
              offset: new AMap.Pixel(-8, -8),
            })
            Mark.on('click',()=>{
              this.map.panTo(marker.position);
              this.point = marker.title
            })

          });
        }
        if(id == 2){
          //自驾
          this.stop = 1;
          if(this.hasPosition){
            $('#panel2').html("");

            let driving = new AMap.Driving({
              map: this.map,
              panel: "panel2"
            });
            // 根据起终点名称规划驾车导航路线
            driving.search(
              new AMap.LngLat(this.userPosition[0],this.userPosition[1]),
              new AMap.LngLat(118.872793,31.735712),
            );
          }else{
            $('#panel2').html("");

            let driving = new AMap.Driving({
              map: this.map,
              panel: "panel2"
            });
            if(this.ss.poi.name == ""){
              Toast('请输入出发地');
              return;
            }
            // 根据起终点名称规划驾车导航路线
            driving.search([
              {keyword: this.ss.poi.name,city:'南京'},
              {keyword: this.stop=='1'?'南京禄口国际机场1号停车场':'南京禄口国际机场2号停车场',city:'南京'}
            ]);
          }
        }
        if(id == 3){
          if(this.hasPosition){
            $('#panel').html("");
            let transOptions = {
              map: this.map,
              city: '南京市',
              panel: 'panel',
            };

            let transfer = new AMap.Transfer(transOptions);

            if(this.$route.params.direction == "D"){
              transfer.search(
                new AMap.LngLat(this.userPosition[0],this.userPosition[1]),
                new AMap.LngLat(118.870224,31.73136),
              );
            }else{
              Toast('请输入目的地');
            }
          }else{
            $('#panel').html("");
            let transOptions = {
              map: this.map,
              city: '南京市',
              panel: 'panel',
            };

            if(this.ss.poi.name == ""){
              Toast('请输入出发地');
              return;
            }

            let transfer = new AMap.Transfer(transOptions);

            if(this.$route.params.direction == "D") {
              transfer.search([
                {keyword: this.ss.poi.name,city:'南京'},
                {keyword: '南京禄口机场',city:'南京'}
              ]);
            }
          }

        }
      },
      init(direction) {
        //A进港、D出港
        if(direction=="D"){
          this.txs = this.xs[1];
          this.tys = this.ys[1];
        }else if(direction=="A"){
          this.txs = this.xs[0];
          this.tys = this.ys[0];
        }
        this.txs = this.txs.split(',');
        this.tys = this.tys.split(',');

        for (let i = 0;i<this.tys.length;i++){
          this.line.push([this.txs[i],this.tys[i]]);
        }
        this.map = new AMap.Map('container', {
          resizeEnable: true,
          zoom: 12
        })

        let polyline = new AMap.Polyline({
          path: this.line,          //设置线覆盖物路径
          strokeColor: "#25C2F2", //线颜色
          strokeOpacity: 1,       //线透明度
          strokeWeight: 4,        //线宽
          strokeStyle: "solid",   //线样式
          strokeDasharray: [10, 5] //补充线样式
        });
        polyline.setMap(this.map);

        this.markers[direction=="D"?1:0].forEach((marker)=> {
          let Mark = new AMap.Marker({
            map: this.map,
            icon: marker.icon,
            position: marker.xy_coords.split(";"),
            offset: new AMap.Pixel(-8, -8),
          })
          Mark.on('click',()=>{
            this.map.panTo(marker.xy_coords.split(";"));
            this.point = marker.name
          })

        });

        let autoOptions = {
          input: "tipinput"
        };
        let auto = new AMap.Autocomplete(autoOptions);
        let placeSearch = new AMap.PlaceSearch({
          map: this.map
        });  //构造地点查询类
        AMap.event.addListener(auto, "select", select);//注册监听，当选中某条记录时会触发
        let that = this;

        function select(e) {
          that.hasPosition = false;
          that.ss = e;
          console.log(e);

          if(that.pageShow == 3){
            $('#panel').html("");
            let transOptions = {
              map: this.map,
              city: '南京市',
              panel: 'panel',
            };

            let transfer = new AMap.Transfer(transOptions);

            if(direction == "D"){
              transfer.search([
                {keyword: e.poi.name,city:'南京'},
                {keyword: '南京禄口国际机场',city:'南京'}
              ]);
            }else{
              transfer.search([
                {keyword: '南京禄口国际机场',city:'南京'},
                {keyword: e.poi.name,city:'南京'}
              ]);
            }

          }

          if(that.pageShow == 1){
            placeSearch.setCity(e.poi.adcode);
            placeSearch.search(e.poi.name);
          }

          if(that.pageShow == 2){
            $('#panel2').html("");

            let driving = new AMap.Driving({
              map: this.map,
              panel: "panel2"
            });
            // 根据起终点名称规划驾车导航路线
            driving.search([
              {keyword: e.poi.name,city:'南京'},
              {keyword: that.stop=='1'?'南京禄口国际机场1号停车场':'南京禄口国际机场2号停车场',city:'南京'}
            ]);
          }
        }

      },
      showAllStation(id){
          this.showStation = true;
          if(id == 1){
            //一号线
            if(this.$route.params.direction == "A"){
              this.stationList = this.allStation[0];
            }else{
              this.stationList = this.allStation[1];
            }
          }else{
            //二号线
            if(this.$route.params.direction == "A"){
              this.stationList = this.allStation[2];
            }else{
              this.stationList = this.allStation[3];
            }
          }
      }
    }
  }
</script>

<style scoped>
  #wall{
    width: 100%;
  }

  #panel2{
    width: 100%;
    display: block;
    background: #fff;
    padding-bottom: 88px;
  }
  #panel3{
    bottom: 0;
  }
  #panel{
    padding-top: 180px;
    width: 100%;
    height: 100%;
    position: fixed;
    background: #fff;
    overflow: scroll;
  }
  #driver{
    padding-top: 180px;
    width: 100%;
    height: 100%;
    position: fixed;
    background: #fff;
    overflow: scroll;
  }
  .station_show{
    padding-top: 180px;
    width: 100%;
    height: 100%;
    position: fixed;
    background: #fff;
    overflow: scroll;
    z-index:5000;
  }

  #container{
    width: 100%;
    height: 100%;
    position: fixed;
  }
  .title_header{
    width: 750px;
    background: #285FB1;
    top: 0;
    z-index: 9999;
    position: fixed;
  }
  /*顶部切换分页样式*/
  .change_page{
    display: flex;
    height: 90px;
    justify-content: center;
    align-items: center;
  }
  .homeIn{
    padding-right: 100px;
  }
  .change_page img{
    display: inline;
    width: 28px;
    margin-right: 10px;
  }
  .change_page div{
    margin:0 20px ;
    display: flex;
    justify-content: center;
    align-items: center;
    width: 190px;
    height: 52px;
    border-radius: 26px;
    text-align: center;
    line-height: 52px;
    font-size: 28px;
    font-family:PingFangSC-Regular;
    color:rgba(40,95,177,1);
    color: #fff;
  }

  .change_page div.active{
    width: 190px;
    height: 52px;
    background: #fff;
    border-radius: 26px;
    text-align: center;
    line-height: 52px;
    font-size: 28px;
    font-family:PingFangSC-Regular;
    color:rgba(40,95,177,1);
  }

  .homeIn div{
    margin:0 10px;
    width: 170px;
  }
  .homeIn div.active{
    width: 170px;
  }
  /*搜索框样式*/
  .search_page{
    height: 90px;
    display: flex;
    justify-content: center;
    align-items: center;
  }
  .search_page input{
    width:686px;
    height:60px;
    background:rgba(255,255,255,0.12) url("./../../../static/img/searchicon.png") no-repeat;
    background-size: 24px;
    background-position: 20px center;
    border-radius:10px;
    outline: 0;
    border:0;
    padding-left: 56px;
    font-size:28px;
    color: #fff;
    -webkit-user-select:auto!important;
  }
  input::-webkit-input-placeholder{
    color:#fff;
  }
  input::-moz-placeholder{   /* Mozilla Firefox 19+ */
    color:#fff;
  }
  input:-moz-placeholder{    /* Mozilla Firefox 4 to 18 */
    color:#fff;
  }
  input:-ms-input-placeholder{  /* Internet Explorer 10-11 */
    color:#fff;
  }
  .info{
    position: fixed;
    display: flex;
    width: 750px;
    background: #fff;
    overflow-y: scroll;
  }
  .plh{
    padding: 20px;
    text-align: center;
    width: 100%;
  }
  .line_page{
    width: 750px;
  }
  .line_title img{
    width: 27px;
    margin-left: 32px;
    margin-right: 20px;
  }
  .line_title{
    height: 88px;
    border-bottom: 1px solid #eee;
    display: flex;
    align-items: center;
    justify-content: space-between;
    padding-right: 32px;
  }
  .line_title img{
    position: relative;
    top: 4px;
  }
  .line_body{
    display: flex;
    align-items: center;
    justify-content: center;
    border-bottom: 1px solid #eee;
    padding: 16px 0;
  }

  .lb1{
    width: 100px;
    display: inline-block;
    font-size:28px;
    text-align: center;
    margin-right: 60px;
  }
  .vline{
    width: 20px;
    display: inline-block;
    height: 100px;
    border-left:1px solid #D8D8D8 ;
  }
  .lb2{
    width: 460px;
    display: inline-block;
    margin-left: 20px;
  }
  .pointName{
    font-size:32px;
    font-family:PingFangSC-Medium;
    color:rgba(51,51,51,1);
    line-height:32px;
    margin-bottom: 20px;
  }
  .pointDetail{
    font-size:28px;
    font-family:PingFangSC-Medium;
    color:rgba(51,51,51,1);
    line-height:36px;
  }
  .checkAll{
    font-size:24px;
    font-family:PingFangSC-Regular;
    color:rgba(40,95,177,1);
    line-height:72px;
    text-align: center;
  }

  .stopPage{
    text-align: center;
    width: 100%;
    background: #fff;
    border-bottom: 1px solid #eee;
    z-index: 9999;
  }
  .stopPage ul{
    display: flex;
    justify-content: center;
    align-items: center;
    text-align: center;
    padding: 30px 0;
  }
  .stopPage ul li{
    width: 343px;
    border: 1px solid #285FB1;
    height: 58px;
    text-align: center;
    line-height: 58px;
  }
  .stopPage ul li:first-child{
    border-bottom-left-radius: 10px;
    border-top-left-radius: 10px;
  }
  .stopPage ul li:last-child{
    border-bottom-right-radius: 10px;
    border-top-right-radius: 10px;
  }
  .stopPage ul li.stopA{
    color: #fff;
    background: #285FB1;
  }


  #cjbc{
    color: #333!important;
    width: 100%;
    height: 100%;
    position: fixed;
    padding-top: 90px;
    background: #fff;
    overflow: scroll;
  }
  #cjbc ul li{
    border-bottom: 16px solid #eee;
    padding: 24px 32px;
    font-size: 22px;
  }
  #cjbc ul li div{
    padding: 10px 0;
    border-bottom: 1px solid #eee;
  }
  .cjbc_title{
    font-size:32px;
    font-family:PingFangSC-Medium;
    color:rgba(51,51,51,1);
    line-height:32px;
    margin-right: 14px;
  }
  .cjbc_price{
    font-size:32px;
    font-family:PingFangSC-Medium;
    color:rgba(51,51,51,1);
    line-height:32px;
    float: right;
  }
  .cjbc_info{
    color: #999!important;
  }
  .showmap{
    position: fixed;
    bottom: 0;
    height:72px;
    background:rgba(255,255,255,1);
    font-size:24px;
    font-family:PingFangSC-Regular;
    color:rgba(40,95,177,1);
    line-height: 72px;
    border-top: 1px solid #eee;
    text-align: center;
    width: 100%;
  }
  .station_list{
    padding-bottom: 73px;
  }

  /*站点列表*/
  .station_list ul li{
    padding: 30px 30px 30px 80px;
    background: url("./../../../static/img/location_point.png") no-repeat;
    background-size: 24px;
    background-position: 32px center;
    display: flex;
    justify-content: space-between;
    align-items: center;
    border-bottom: 1px solid #eee;
  }
  .station_list ul li span{
    font-size:32px;
    font-family:PingFangSC-Regular;
    color:rgba(51,51,51,1);
    line-height:48px;
    display: inline-block;
    max-width: 512px;
  }

  #stopDetail{
    position: fixed;
    bottom: 0;
    height: 88px;
    line-height: 88px;
    font-size:32px;
    font-family:PingFangSC-Regular;
    color:rgba(51,51,51,1);
    padding:0 32px;
    width: 100%;
    border-top: 6px solid #eee;
    background: #fff url("./../../../static/img/Shape.png") no-repeat 98%;
    z-index: 9998;
  }
  #switch_way{
    position: fixed;
    right: 0;
    margin: 0;
    width: 140px;
    border: 1px solid #fff;
    border-top-right-radius: 0;
    border-bottom-right-radius: 0;
    padding-left: 12px;
    border-right: 0;
  }

</style>
<style>
  .amap-call{
    display: none;
  }
  .amap-lib-transfer{
    width: 750px;
  }
  .amap-lib-transfer .planTitle {
    border-top: 0;
    border-bottom: 1px solid #eee;
    margin-bottom: 0px;
    padding: 20px;
  }
  .amap-lib-transfer{
    border: 0;
  }
  .amap-logo{
    z-index: -99;
  }
  .amap-copyright{
    z-index: -99;
  }
  .amap-sug-result{
    z-index: 11010;
  }
  .amap-lib-transfer .planTitle{
    background: #fff;
  }
  .amap-lib-transfer .planTitle ul{
    display: none!important;
  }
  .amap-lib-transfer .plan{
    margin: 0;
  }

  .amap-lib-transfer .plan dt:first-child{
    border-top: 0;
  }
  .amap-lib-driving{
    border: 0;
  }
</style>
